{
  "subject": "CIVICS",
  "education": "secondary",
  "level": "1",
  "table_contents": {
    "Chapter One: Introduction to Civics": "1",
    "Meaning of Civics": "1",
    "Main themes addressed in Civics": "1",
    "Relationship between Civics and other subjects": "3",
    "Importance of studying Civics": "4",
    "Revision exercise": "5",
    "Chapter Two: Our nation": "6",
    "Meaning of nation": "6",
    "Components of our nation": "7",
    "National symbols": "9",
    "Recognising and valuing Tanzania’s national festivals": "17",
    "Categories of Tanzania’s national festivals": "18",
    "Significance of the National Festivals": "21",
    "Revision exercise": "22",
    "Chapter Three: Promotion of life skills": "24",
    "Meaning of life skills": "24",
    "Types of life skills": "24",
    "Individual life skills": "24",
    "Social life skills": "33",
    "Effective decision-making skills": "41",
    "Promoters of life skills": "41",
    "Importance of life skills": "44",
    "How to use life skills": "44",
    "Consequences of not using life skills": "44",
    "Revision exercise": "45",
    "Chapter Four: Human rights": "48",
    "Meaning of human rights": "48",
    "Universal Declaration of Human Rights": "48",
    "Types of human rights": "49",
    "Categories of human rights": "49",
    "Importance of human rights": "51",
    "Relationship between human rights and the provision of basic needs": "52",
    "Role of the government in promoting human rights in Tanzania": "53",
    "Role of NGOs and the media in promoting human rights": "53",
    "Individual human rights": "55",
    "Protection of individual rights": "55",
    "Limiting individual rights": "55",
    "Purposes for limiting individual rights": "56",
    "Conditions which may hinder the implementation of individual rights": "57",
    "Human rights abuse": "58",
    "Effects of human rights abuse": "59",
    "Ways to combat human rights abuse": "60",
    "Revision exercise": "61",
    "Chapter Five: Responsible citizenship": "63",
    "Meaning of citizen and citizenship": "63",
    "Types of citizenship": "63",
    "Privileges of citizenship": "65",
    "Conditions which can cause a person to lose his or her citizenship in Tanzania": "66",
    "Consequences of staying or living in a country without being a citizen": "66",
    "Civic responsibilities": "67",
    "Importance of civic responsibilities to communities and a nation": "69",
    "Categories of special groups": "69",
    "Needs of special groups": "70",
    "Responsibilities of citizens to special groups": "72",
    "Revision exercise": "73",
    "Chapter Six: Career and work-related activities": "75",
    "Meaning of career and related concepts": "75",
    "Factors affecting career development": "75",
    "Meaning of work": "77",
    "Types of work-related activities": "77",
    "Choosing a career": "79",
    "Sources of information on careers": "80",
    "Importance of work to personal and national development": "81",
    "Revision exercise": "83",
    "Chapter Seven: Family life education": "85",
    "Concept of family": "85",
    "Types of families": "86",
    "Importance of a family": "86",
    "Factors contributing to family stability": "87",
    "Importance of family stability and healthy relationships": "90",
    "Responsibilities of family members": "91",
    "Children’s responsibilities": "92",
    "Parents’ responsibilities": "92",
    "Consequences of not fulfilling family responsibilities": "93",
    "Revision exercise": "93",
    "Chapter Eight: Proper behaviour and decision making": "94",
    "Meaning of behaviour": "94",
    "Types of behaviour": "94",
    "Factors influencing our behaviour": "95",
    "Elements or indicators of proper and improper behaviours": "96",
    "Importance of behaving properly": "97",
    "Consequences of improper behaviour": "97",
    "Avoiding improper behaviour": "98",
    "Rational decision-making": "99",
    "Rational decision-making steps": "99",
    "Skills for making rational decisions": "100",
    "Steps of problem-solving": "101",
    "Importance of making rational decisions": "101",
    "Ways of avoiding making irrational decisions": "102",
    "Revision exercise": "103",
    "Chapter Nine: Road safety education": "105",
    "Meaning of road safety education": "105",
    "Road signs": "105",
    "Interpretation of road signs": "106",
    "Importance of obeying road signs": "113",
    "Consequences of not obeying road signs": "113",
    "Causes of road accidents": "114",
    "Magnitude of road accidents in Tanzania": "114",
    "Effects of road accidents": "116",
    "Prevention of road accidents": "116",
    "Helping people with disabilities, children and the elderly to cross roads": "117",
    "Revision exercise": "121"
  },
  "chapters": [
    {
      "chapter_number": 1,
      "chapter_title": "Introduction to Civics",
      "introduction": "Civics is an important subject that provides us with knowledge and skills to engage fully in social, political and economic activities taking place in our community. In this chapter, you will be introduced to Civics as a subject in secondary schools. You will learn about the meaning of Civics, main themes addressed in Civics, the relationship between Civics and other subjects as well as the importance of studying Civics. The competencies developed will enable you to appreciate the importance of studying Civics and the relationship between Civics and other subjects.",
      "pages": [
        {
          "page_number": 1,
          "subtopic": "Meaning of Civics",
          "content": "**Meaning of Civics**\nCivics is the study of rights, duties and responsibilities of citizens. The term Civics is derived from the Latin word *Civicus*, which means relating to citizens. Generally, Civics deals with the study of organisation, structure and governance in society, people’s ways of life as well as their individual and civic rights. It includes the study of civil laws and citizens’ code of conduct. It also studies government institutions and how they operate."
        },
        {
          "page_number": 1,
          "subtopic": "Main themes addressed in Civics",
          "content": "**Main themes addressed in Civics**\nCivics covers many themes. However, the following are seven major themes addressed in Civics:\n\n**Governance and Government:** The term governance is used to mean the manner in which a country is governed. It looks at the ways in which decisions, processes and activities are determined and implemented. Some of these aspects of governance include accountability, transparency, rule of law and separation of powers. By contrast, government refers to instrument used to govern a country. In Tanzania, the government has three branches, namely, the Executive, Judiciary, and Legislature. The study of Civics enables students to understand these aspects and become responsible citizens of the country."
        },
        {
          "page_number": 2,
          "subtopic": "Main themes addressed in Civics",
          "content": "**International relations:** Countries in the world do not exist in isolation. There are social, economic and political relationships among the countries in the world. The study of Civics helps students to understand both bilateral and multilateral relations among global communities. Such relations can be pioneered by individual nations or by multinational organizations such as United Nations (UN), International Monetary Fund (IMF) and the World Bank. Furthermore, countries may formulate regional integrations in order to enjoy social and economic benefits. In Africa, there are several regional integrations such as East African Community (EAC), Southern Africa Development Community (SADC) and others.\n\n**Civic engagement:** It involves participating in activities intended to improve the quality of life in one’s community by addressing issues of public concern. Such issues include homelessness, food insecurity, and developing the knowledge and skills needed to address those issues. Civic engagement may involve both political and non-political activities such as voting, volunteering and participating in group activities. As a subject, Civics enables students to understand their rights and responsibilities in society. In so doing, students are inspired to become responsible citizens and understand their roles in civic engagement.\n\n**Human rights:** In Civics, human rights refer to basic and fundamental values and freedom that a person has because he or she is a human being. Sometimes, the idea of human rights also includes civic and moral rights. The knowledge of rights enables students to be aware of their rights so as to demand and protect them.\n\n**Morals and family values:** The development of the society and the nation at large depends on strong morals and values at individual and family levels. Civics, therefore, introduces students to the discussion of social morals, family values and life skills. Knowledge and skills under this theme enables students to manage conflicts and address violence, crimes, gender discrimination and child abuses.\n\n**Cultural issues:** The cultural aspects of Civics include languages, beliefs, customs, traditions, moral and values. The study of Civics introduces students to different cultural practices found in the country. The acquired knowledge enables students to become aware of their culture, and that of others, to enhance respect and peace in the society.\n\n**Economic issues:** Civics promotes awareness and participation of citizens in production, consumption and distribution of resources and hence prepares students to become better participants in economic activities for their personal and national development."
        },
        {
          "page_number": 3,
          "subtopic": "Relationship between Civics and other subjects",
          "content": "**Relationship between Civics and other subjects**\nCivics is related to History through learning about various national festivals which reflect past events in our country and the world. Through these national festivals, people learn important lessons which elaborate on the past, present and predict the future. National festivals help people learn about establishing and maintaining social, economic and political relationships with others from different countries.\n\nIn addition, the development of Information and Communication Technology (ICT) has increased and simplified interactions of people in the world. In this regard, Civics relates to ICT through learning issues of globalization that help people to develop awareness on contribution, challenges and adverse impact of ICT in the world.\n\nFurthermore, Civics is related to Language. People can exercise freedom of expression and association through language. In some countries, also, language can be a national symbol. For example, in Tanzania, Kiswahili language is one of the national symbols and it is taught in schools as a subject. Likewise, in teaching English language as a subject in schools, novels and fictions are used to explain social and political issues which may enhance students’ ability to reflect on their real life and social events.\n\nMoreover, patriotism, which is an important theme in Civics, cannot be inculcated without the understanding of geographical boundaries of a country, available natural resources and the environment. Civics in this regard, is related to Geography, which addresses issues of environmental conservation and sustainability of natural resources. In view of this, Civics promotes citizens’ commitment in protecting geographical boundaries and public resources.\n\nIn relation with science subjects, Civics underscores the need for citizens to develop life skills necessary for social adjustment. In this aspect, reproductive health education, for example, in Biology may act as an important tool for encouraging citizens to avoid risky behaviours such as smoking, alcoholism and unhealthy sexual relationships which could otherwise lead to Sexually Transmitted Infections (STIs) and unwanted pregnancies. In view of this, the study of Civics enables students to understand these aspects and become healthy and good citizens.",
          "exercise": "1.1"
        },
        {
          "page_number": 4,
          "subtopic": "Importance of studying Civics",
          "content": "**Importance of studying Civics**\nCivics introduces students to the basics of government in terms of its structure, functions as well as the separation of powers. Civics prepares students to be responsible citizens who understand their responsibilities and rights. Citizens have their rights and responsibilities as stated by the Constitution of the United Republic of Tanzania and by-laws made by local government authorities.\n\nCivics also, introduces students to life skills, family relations, proper behaviour as well as career and work related activities. The subject helps students to understand themselves to be more confident and self-conscious citizens.\n\nMoreover, in every country, people have their culture which governs their lives. As a result of learning Civics, students live according to their culture, and therefore, maintain their identity to become acceptable members of society.\n\nFurthermore, Civics teaches students to participate in learning activities such as public discussions on different issues. Students, for instance, learn how to engage in civic responsibilities such as voting and working with other community members to improve the standard of living. In the school context, students learn how to participate in democratic processes such as voting for school leaders. This offers them an opportunity to practise leadership and motivates them to participate in future political activities.\n\nIn addition, Tanzania does not exist in isolation. Thus, through Civics, students learn about the relationship between Tanzania and other nations. They learn how the world is organised and how Tanzania and other nations influence each other. They also learn about the functions of major international organisations and institutions."
        },
        {
          "page_number": 5,
          "subtopic": "Importance of studying Civics",
          "content": "",
          "revision_exercise": "1"
        }
      ]
    },
    {
      "chapter_number": 2,
      "chapter_title": "Our nation",
      "introduction": "Any nation should have national symbols, values and other important components that identify it inside and outside the country. In this chapter, you will learn about the concept of a nation, Tanzania’s national symbols, the significance of each symbol as well as the components of a nation. Furthermore, you will learn about Tanzania’s national festivals and their significance. The competencies developed will enable you to develop a sense of awareness and become patriotic. They will also enable you to use national symbols and values to protect, honour and publicise your country.",
      "pages": [
        {
          "page_number": 6,
          "subtopic": "Meaning of nation",
          "content": "**Meaning of nation**\n[FIGURE 2.1: Map of Tanzania]\nA nation is a large group of people who live in a particular geographical location and who have their own sovereignty, culture, history and government. In other words, a nation is referred to as a cultural and political community with complete autonomy, unity and common interests. Internationally, a nation should be recognised as having a geographical territory and political leadership. Its people must have the same political ambitions and goals. At the international level, a nation is a sovereign country or an independent state. It is also referred to as a state which is defined as an organised population with full political power and authority."
        },
        {
          "page_number": 7,
          "subtopic": "Components of our nation",
          "content": "**Components of our nation**\nThe components of a nation are aspects that make it a complete nation. Tanzania is a nation which was formed after the union of two states, namely Tanganyika and Zanzibar on 26thApril 1964. Tanzania has five essential components, namely, territory, sovereignty, government, population and culture. All these components are supposed to be familiar to each citizen of Tanzania.\n\n**Territory**\nTerritory is defined as an internationally recognised geographical area. As a nation, Tanzania is internationally recognised as having geographical boundaries. Tanzania has approximately 947,303 square kilometres of land. While 93.8% of her land is suitable for human activities, 6.2% is covered by water. The land is used for farming, settlement, mining as well as construction of factories for the purpose of enhancing economic development. Since Tanzania borders other countries, each citizen is responsible for protecting its boundaries by ensuring that invaders are reported to the respective authorities. In addition, for the sake of future generations, everyone must use the land sustainably.\n\n**Sovereignty**\nThis concept refers to the supreme power that a particular nation or state has to make decisions on its affairs without interference from other nations. In the past, nations were ruled by kings or other nations. Nations which were ruled by other nations lacked sovereign power. Sovereignty is the total independence and autonomy that a nation has with respect to the decisions it takes in matters concerning its people, socio-economic and political aspect. Sovereignty gives a nation freedom to make decisions on various matters such as the kind of leadership it wants and type of foreign policies. A sovereign nation is expected to be autonomous and independent."
        },
        {
          "page_number": 8,
          "subtopic": "Components of our nation",
          "content": "in making its own decisions.\n\n**Government**\nThis is a system or group of people with legal authority to guide or control an organised society or country. It performs administrative functions such as collecting taxes and providing social services. It formulates and implements public policies and exercises political and sovereign power through its institutions. The Government of Tanzania is responsible for providing social services for its people and protecting them from internal and external enemies. This promotes their well-being and development. Therefore, as a good citizen of Tanzania, you are obliged to learn about, respect and be accountable to the government.\n\n**Population**\nThe word population refers to the number of people living in a particular geographical area such as a village, district, region or country. As a component of a nation, it provides the human resources needed in a particular nation. According to the official census conducted in 2012, the population of Tanzania was 44,928,923. Up to 2021 the population is estimated to be 59.7 million people. Tanzania is inhabited by more than 120 ethnic groups, each with its language. Despite these differences, our nation has strong unity. The unity that exists in Tanzania helps people to be internationally recognised and respected. It is the duty of each citizen to maintain and protect the unity that exists in our country.\n\n**Culture**\nThe word culture refers to the customs, civilisation and achievements of a particular people. Culture introduces and represents people’s daily activities such as arts and beliefs passed from one generation to another. It also includes the accepted forms of behaviour and the norms, language, rituals, clothing, religion as well as customs and traditions of the people. It is through culture that people build unity and solidarity. For example, the late Mwalimu Julius Kambarage Nyerere used Kiswahili language to unite the people before and after independence. The components described above differentiate one nation from another. However, owing to global interactions, a nation may find itself having more than one culture, language and religion."
        },
        {
          "page_number": 9,
          "subtopic": "Components of our nation",
          "content": "",
          "exercise": "2.1"
        },
        {
          "page_number": 9,
          "subtopic": "National symbols",
          "content": "**National symbols**\nThe word symbol refers to a mark or sign that stands for/or represents an object or idea in a society. Examples of symbols are a flag, a badge and an emblem. National symbols are features or signs that identify a country as an independent and sovereign state. Each country has its own national symbols. The following are Tanzania’s national symbols:\n(a) The National Flag\n(b) The National Anthem\n(c) The Coat of Arms\n(d) The Uhuru Torch\n(e) The Giraffe\n(f) The National Currency\n(g) The National Language\n(h) The National Constitution\n(i) The Presidential Standard\n\n**The National Flag**\nA national flag has specific colours and symbols that represent or have a certain"
        },
        {
          "page_number": 10,
          "subtopic": "National symbols",
          "content": "meaning to a particular nation. The United Republic of Tanzania’s Flag is one of the beautiful flags in the world. It was adopted in 1964 when the flags of Tanganyika and Zanzibar were combined into one following the union of the two states in that particular year. Aspects of the two original flags can be seen on the current Tanzania’s National Flag. It is made up of four colours, namely, green, yellow, black and blue. The green colour represents natural vegetation and the yellow colour represents the mineral wealth of our country. The population of the country is represented by the black colour and the blue colour symbolises water bodies such as the Indian Ocean, lakes and rivers. [FIGURE 2.2: The National Flag of the United Republic of Tanzania]\n\nThe National Flag is a symbol that signifies the independence and sovereignty of Tanzania. Every Tanzanian must respect and protect the National Flag. For example, you are supposed to stand still when the Flag is being hoisted or lowered in public places such as at school, government offices and police posts. Waving the National Flag on different occasions such as international football matches or other special events inside and outside the country develop a sense of patriotism."
        },
        {
          "page_number": 11,
          "subtopic": "National symbols",
          "content": "**The National Anthem**\nThe National Anthem is an official song for formal government activities. The National Anthem of Tanzania is sung in special national events such as when the President is about to address the nation. It is also sung when the President or Vice-President visits another country, during international sport competitions, national celebrations or festivals and before announcement of the death of a top government leader such as a President, Vice-President or Prime Minister.\n\nHowever, in schools and defence forces, the National Anthem is sung to inculcate a sense of patriotism. Therefore, everyone should learn how to sing it and feel proud of being a Tanzanian.\n\nOur National Anthem has two stanzas, which are ‘Mungu ibariki Afrika’ and ‘Mungu ibariki Tanzania’. Each stanza consists of four verses and a chorus. Below is the National Anthem of the United Republic of Tanzania.\n\n*Mungu ibariki Afrika,*\n*Wabariki viongozi wake*\n*Hekima umoja na amani*\n*Hizi ni ngao zetu.*\n*Afrika na watu wake*\n*Kibwagizo*\n*Ibariki, Afrika*\n*Ibariki, Afrika*\n*Tubariki watoto wa Afrika*\n\n*Mungu ibariki Tanzania,*\n*Dumisha uhuru na umoja*\n*Wake kwa waume na watoto*\n*Mungu ibariki,*\n*Tanzania na watu wake*\n*Kibwagizo*\n*Ibariki, Tanzania*\n*Ibariki, Tanzania*\n*Tubariki watoto wa Tanzania*"
        },
        {
          "page_number": 12,
          "subtopic": "National symbols",
          "content": "**The Coat of Arms**\nThe Coat of Arms is also known as the national emblem or logo. It is the official seal or stamp that signifies the authority of the government of a given country. It is the sign of state power and wealth. The coat of arms is used to signify the ownership of documents and assets by the government. It appears in all government publications, books, national passports and the uniforms of high-ranking military officers. It is also used in written government official communication and announcements. The Coat of Arms of the United Republic of Tanzania has elements which must be recognised and respected by all Tanzanians. These elements are as follows:\n\n**Two human figures:** A man and a woman. The figures represent the people of Tanzania. The two figures symbolise gender equality and cooperation between men and women in bringing about national development in our country.\n\n**The national flag:** The flag is a symbol of our national freedom. The flag signifies the independence of our country.\n\n**The uhuru torch:** It represents our national freedom, prosperity, peace, hope and enlightenment of all Tanzanians.\n\n**The crossed axe and hoe:** These represent the production tools which Tanzanians use.\n\n**The elephant tusks:** The tusks represent our national heritage such as wildlife.\n\n**The shield and spear:** These signify the traditional weapons used for defence and security purposes.\n\n**The blue waves:** The waves represent water bodies such as lakes, ocean and rivers found in the United Republic of Tanzania.\n\n**Cloves and cotton:** They represent the cash crops grown in the United Republic of Tanzania.\n\n**The words Uhuru na Umoja:** They refer to the freedom and unity that exist in Tanzania. They constitute the motto of our nation.\n\n**Mount Kilimanjaro:** It shows that the United Republic of Tanzania is proud to have the highest mountain in Africa.\n\n**The red part:** The red part of the Coat of Arms represents the fertile land available in Tanzania.\n\n**The yellow part:** Represents the mineral wealth found in Tanzania such as tanzanite, gold, tin and copper."
        },
        {
          "page_number": 13,
          "subtopic": "National symbols",
          "content": "[FIGURE 2.3: The Coat of Arms]\n\n**The Uhuru Torch**\nThe Uhuru Torch is one of the national symbols of Tanzania. It symbolises the freedom, peace, unity, hope and enlightenment of Tanzanians. It was first lit on the top of Mount Kilimanjaro on 9th December 1961. Symbolically, it shines across the country to eliminate despair and promote love where there is hatred and harmony where there is enemy. Every year, the Uhuru Torch race starts and ends in different prominent places in our country. The race is intended to inspire people and educate them on the socio-economic and political affairs pertaining to our country. The messages conveyed by the Uhuru Torch promote positive political, social and economic changes. For example, some development projects such as construction of schools and health centres are inaugurated during the Uhuru Torch race. [FIGURE 2.4: The Uhuru Torch of Tanzania]"
        },
        {
          "page_number": 14,
          "subtopic": "National symbols",
          "content": "The following song was sung when the Uhuru Torch was first lit on the top of Mount Kilimanjaro on 9th December 1961.\n\n**Sisi tumekwisha kuwasha mwenge**\n*Sisi tumekwisha kuwasha mwenge, tumekwisha kuwasha mwenge*\n*Na kuuweka juu ya mlima, mlima Kilimanjaro*\n*Kuwasha mwenge, kuwasha mwenge*\n\n**Kibwagizo**\n*Na kuuweka Kilimanjaro*\n*Na kuuweka Kilimanjaro*\n*Umulike hata nje ya mipaka yetu, ulete tumaini*\n*Pale ambapo hakuna matumaini*\n*Upendo mahali ambapo pana chuki*\n*Na heshima ambapo pamejaa dharau.*\n\n**The Giraffe**\nThe Giraffe is Tanzania’s national symbol protected by the law. The Giraffe is a beautiful animal, whose long neck reflects Tanzanians ability to be visionary while still seeing the past and understanding their country by viewing life from different angles. The Giraffe is drawn on the planes belonging to Air Tanzania to signify the country’s natural resources. [FIGURE 2.5: The image of a Giraffe drawn on Air Tanzania’s plane]"
        },
        {
          "page_number": 15,
          "subtopic": "National symbols",
          "content": "**The National Currency**\nA currency is money which has value and used by people of a certain country for economic exchange purposes. A national currency is a legal money used in a country to pay for goods and services. It is a symbol of the Tanzania nation, since it signifies national identity as well as the resources of the nation. Our national currency is the Tanzanian shillings (TZS). It is in the form of banknotes and coins. The banknotes have the values of 1000, 2000, 5000 and 10000 shillings and the coins have value of 50, 100, 200, and 500 shillings. The coins used in Tanzania are made of brass, except for 500 shillings which is made of nickel-plated steel. Tanzanian shillings are issued and managed by the Bank of Tanzania (BoT). Therefore, it is a crime for an individual to deliberately destroy or produce national currency. Also, it is illegal to use the national currencies to buy other people’s rights and services which are supposed to be provided free of charge. [FIGURE 2.6: The national currency of Tanzania]\n\n**The National Language**\nLanguage is a tool of communication. It is used to transmit information, knowledge, skills and values from one person to another. Kiswahili is both our national language and symbol since it conveys and represents our cultural values.\n\nAs our national language, Kiswahili has played a significant role in unifying the people before, during and after independence. Every Tanzanian has to be proud of this language because it brings people together. Also, it has helped to create employment opportunities for many Tanzanians within and outside the country. They have been employed as Kiswahili language teachers, translators and interpreters. It is also used in official communication in the country and adopted as one of the official languages used in international community meetings such as African Union (AU),"
        },
        {
          "page_number": 16,
          "subtopic": "National symbols",
          "content": "East African Community (EAC) and Southern African Development Community (SADC). Therefore, it is important for every Tanzanian to learn Kiswahili because it is our national identity.\n\n**The National Constitution**\nA constitution is a body of laws and principles by which an organisation, a state or a nation is governed. The Constitution of the United Republic of Tanzania is a body of laws and principles which are used to govern the country. It stipulates the content and form of the Government of Tanzania and the separation of powers among the state organs, namely, the Executive, Legislature and Judiciary. The Constitution stipulates the relationship between citizens and their leaders, as well as their rights and duties. The Constitution of Tanzania is the mother law because all other laws originate from it. The Constitution helps people to demand their rights before the courts of law. Since it is an important symbol of our nation, every Tanzanian is encouraged to read and understand it. [FIGURE 2.7: The front cover of the Constitution of the United Republic of Tanzania]\n\n**The Presidential Standard**\nThe Presidential Standard, which is also known as the Presidential Flag, symbolises the power and authority of the President of the United Republic of Tanzania. It is green in colour with a blue strip around the edge of the Coat of Arms. It is used to indicate the presence of the President during official functions inside and outside the country. The Coat of Arms which appears on the presidential flag does not have two human figures, mount Kilimanjaro or crops. [FIGURE 2.8: The Presidential Standard of the United Republic of Tanzania]."
        },
        {
          "page_number": 17,
          "subtopic": "National symbols",
          "content": "[FIGURE 2.8: Presidential Standard]",
          "exercise": "2.2"
        },
        {
          "page_number": 17,
          "subtopic": "Recognising and valuing Tanzania’s national festivals",
          "content": "**Recognising and valuing Tanzania’s national festivals**\nNational festivals which are also refered as a public holidays are special events marked to honour something that took place in our country. They are used to remember significant past events. During such events, people celebrates by doing various activities that carry a specific message for citizens."
        },
        {
          "page_number": 18,
          "subtopic": "Recognising and valuing Tanzania’s national festivals",
          "content": "Read the following passage and answer the questions that follow.\n\nKondo was a Form One student at Kibasila Secondary School. He lived at Mtoni Kwa Azizi Ali in Temeke District, Dar es Salaam Region. When he was young, his father, Mzee Simba, used to take him to the National Stadium during various national festival celebrations. As Kondo grew up, he continued attending national events at the National Stadium. As he attended such events, he got an opportunity to see the President, the Vice-President, the Prime Minister and other national leaders. He knew the leaders well because he saw them directly and remembered their names. He also saw leaders of other countries such as the Presidents of Kenya, Uganda, Rwanda, Burundi, Zimbabwe and South Africa.\n\nEvery time he attended national festivals, he got information on social, political and economic matters. For instance, his attendance on the Independence Day enabled him to appreciate the value of our independence and the need to protect our country from external and internal enemies. He also learnt about the importance of national unity for national development. He learnt that the people of Tanzania are equal and need to love each other, regardless of their differences in ethnicity, race, gender, language or religion. As a result of his participation in various national events, Kondo’s performance in Civics, History and Geography improved steadily. His conduct inspired fellow students.",
          "exercise": "2.3"
        },
        {
          "page_number": 18,
          "subtopic": "Categories of Tanzania’s national festivals",
          "content": "**Categories of Tanzania’s national festivals**\nTanzania’s national festivals may be categorised into two groups, namely, public national festivals and public religious festivals."
        },
        {
          "page_number": 19,
          "subtopic": "Categories of Tanzania’s national festivals",
          "content": "**Public national festivals**\n**(a) Independence Day, on 9th December:** Tanganyika gained her independence from British rule on 9th December 1961. It became a republic on 9th December 1962. On 9th December every year, Tanzania celebrates her Independence Day. To honour the day, the government organises various activities at the district, regional and national levels. Normally, government leaders, including the President of the United Republic of Tanzania, address the nation on the Independence Day. Parades and traditional dances are held to entertain the people who attend the festival.\n\n**(b) Zanzibar Revolution Day, on 12th January:** The day is marked to honour the over-throw of the sultanate government on 12th January 1964. The new government was formed under the leadership of the late Sheikh Abeid Amani Karume, as the first President of Zanzibar. On 12th January every year, Tanzanians celebrates the Zanzibar Revolution day. The celebrations include various activities, such as a football tournament known as the ‘Mapinduzi Cup’. People sing songs and dance to remember those who sacrificed their lives during the revolution. Government leaders address the nation to commemorate the revolution day.\n\n**(c) Nyerere’s Memorial Day, on 14th October:** It is the day when Mwalimu Julius Kambarage Nyerere died on 14th October 1999 at St. Thomas Hospital in London. Mwalimu Nyerere was the first President of Tanzania who fought for the independence of our country. The union of Tanganyika and Zanzibar, signifies nationhood and the unity of all Tanzanians. The day honours his great contributions to the country.\n\n**(d) Karume’s Memorial Day, on 7th April:** The first President of Zanzibar, the late Sheikh Abeid Amani Karume was assassinated on 7th April 1972 at the headquarters of the Afro-Shirazi Party in Zanzibar. Therefore, on 7th April every year, Tanzanians remember his great contributions as a leader who fought for Zanzibar Revolution and one of the pioneer of the union of Tanganyika and Zanzibar.\n\n**(e) The Union Day, on 26th April:** The United Republic of Tanzania was formed on 26th April 1964 following the union of Tanganyika and Zanzibar. It was an agreement signed by the two Presidents, late Sheikh Abeid Amani Karume and Mwalimu Julius Kambarage Nyerere. The union of the two independent"
        },
        {
          "page_number": 20,
          "subtopic": "Categories of Tanzania’s national festivals",
          "content": "countries is one of the landmarks in the history of Tanzania. On the Union Day, government leaders address the public and underscore the importance of maintaining the union.\n\n**(f) Saba Saba Day, on 7th July:** It began as a day to celebrate the formation of TANU on 7th July 1954. It was also meant to celebrate farmers and workers. Later in 1993, following the introduction of multi-party system in 1992, the day was changed to become Dar es Salaam International Trade Fair Day. The day is used to promote locally made goods and services. Traders from Tanzania and outside the country are usually invited to participate in the exhibitions.\n\n**(g) Nane Nane Day, on 8th August:** The day began in 1993 to advocate for agricultural development in our country on 8th August every year. Like other public holidays, farmers exhibit their agricultural produce and machines on that day. Normally, one zone located in a specific region in our country is chosen to host the celebrations at national level.\n\n**(h) Labour Day, on 1st May:** This festival is celebrated on 1st May each year. It is also known as Workers’ Day. It is an international public festival, which is celebrated all over the world. On that day, workers express their grievances and expectations to the government and employers which need the attention of policy and decision makers at the national level.\n\n**(i) The New Year, on 1st January:** This festival takes place on 1st January each year. It is an international holiday, in which people around the world celebrate the start of a new year.\n\n**Public religious festivals**\nThe following are some of the public religious festivals celebrated in Tanzania:\n\n**(a) Good Friday, Easter and Easter Monday:** On these days every year, Christians in Tanzania unite with other Christians in the world to celebrate and remember the suffering, death and resurrection of Jesus Christ. During these days, Christians give gifts to the poor, visit and eat with them.\n\n**(b) Eid el Fitr:** This is celebrated by Muslims to mark the end of the Holy Month of Ramadhan. On this day, Muslims normally give gifts to the poor, visit and eat with them to celebrate the holy month.\n\n**(c) Eid el Hajj:** This is celebrated to mark the end of pilgrimage or “Hajj” which"
        },
        {
          "page_number": 21,
          "subtopic": "Categories of Tanzania’s national festivals",
          "content": "is the fifth pillar of Islam. The date depends on the sighting of the moon. Muslims make sacrifices by slaughtering goats or sheep and give gifts to the poor, orphans and widows.\n\n**(d) Christmas and Boxing Day:** These fall on 25th and 26th December, respectively. On 25th December each year, Christians remember the birth of Jesus Christ. Usually, they go to church, stay at home with their families, eat, drink and give gifts to each other. They also give basic needs such as clothes and food to the needy, orphans and widows. Boxing Day is the first day after Christmas. It is therefore celebrated on 26th December to mark the end of Christmas celebrations. Christians use the boxing day to reflect on the coming of Jesus and to open gifts received from family members or friends.\n\n**(e) Maulid Day:** This is the day used to commemorate the birth of the Prophet Muhammad (S.A.W). The date and month depend on the Islamic calendar."
        },
        {
          "page_number": 21,
          "subtopic": "Significance of the National Festivals",
          "content": "**Significance of the National Festivals**\nThe national festivals have the following significance:\n(a) The celebration of national festivals promotes unity among citizens within the country and with those from other countries;\n(b) Government leaders use the celebrations as forums to pass important information to the public. The purpose is to encourage and inspire citizens to engage in socio-economic and political activities for personal and national development;\n(c) Citizens get the opportunity to express their feelings, opinions and views to their local and national leaders;\n(d) Those who attend the festivals get an opportunity to meet and share their experiences and aspirations about socio-economic and political matters; and\n(e) By organising and attending national festivals, we promote and keep the history of our country in people’s minds. This helps people to know where their country has come from and to predict its future for the betterment of the country."
        },
        {
          "page_number": 22,
          "subtopic": "Significance of the National Festivals",
          "content": "",
          "revision_exercise": "2"
        }
      ]
    },
    {
      "chapter_number": 3,
      "chapter_title": "Promotion of life skills",
      "introduction": "Often life demands us to use skills effectively to deal with life challenges. In this chapter, you will learn about the concept, types, and importance of life skills. You will also learn how to develop and use life skills, and analyse the consequences of not using life skills properly. The competencies developed will help you to have a greater sense of self-awareness, develop the ability to analyse options and make rational decisions. You will also develop confidence and habit of appreciating others.",
      "pages": [
        {
          "page_number": 24,
          "subtopic": "Meaning of life skills",
          "content": "**Meaning of life skills**\nLife skills can be defined as the ability to think and use knowledge to solve personal and social problems or challenges. They are acquired through direct life experiences or developed through formal education. For example, one needs to have skills such as self-awareness, social awareness, willingness to understand ideas of other people, communicating ideas clearly and appropriately, solving problems and making good decisions. These skills and others help a person to cope with various challenges and problems facing him or her in the daily life."
        },
        {
          "page_number": 24,
          "subtopic": "Types of life skills",
          "content": "**Types of life skills**\nLife skills may be divided into three types, namely, individual life skills (intra-personal life skills), social life skills (inter-personal life skills) and effective decision-making skills."
        },
        {
          "page_number": 24,
          "subtopic": "Individual life skills",
          "content": "**Individual life skills**\nThese are skills that enable an individual to understand who he or she is, what he or she is capable of and why he or she is living. Examples of individual life skills include self-worth, self-awareness, self-esteem, self-assertiveness, self-confidence and self-dependence. Other skills are coping with emotions, problem solving, coping with depression and stress management."
        },
        {
          "page_number": 25,
          "subtopic": "Individual life skills",
          "content": "**Self-awareness**\nSelf-awareness means understanding who you are in terms of your behaviour, what you can do and what you cannot do. Awareness begins with your ability to identify your emotions, needs and habits, and to understand your strengths, weaknesses and personal values. Self-awareness influences how you perceive yourself, how you think about yourself, how you act and how you relate with other people.\n\nYou can develop self-awareness by doing the following activities:\n(a) Looking at yourself objectively: Assess your thoughts, attitudes and behaviour. A person who is aware of himself or herself is empowered to make changes;\n(b) Reflecting on your actions daily: Processing your thoughts and feelings helps you to identify your strengths and weaknesses; and\n(c) Soliciting feedback from trusted friends: People’s descriptions will help you to know how they perceive and view you. Sometimes our friends’ descriptions help us to change our bad habits.\n\n**Self-worth**\nSelf-worth is an unconditional value that we associate with ourselves. It is accumulated through personal experience and feedback from peers and persons of high authority such as parents and teachers. Self-worth determines how we talk to ourselves, how we think of ourselves, how we see ourselves, how we feel about ourselves and how we behave in relation to our values. People with high self-worth have a positive view of themselves, trust their abilities, are happier, take care of themselves and are in positive relationships with others."
        },
        {
          "page_number": 26,
          "subtopic": "Individual life skills",
          "content": "**Self-esteem**\nIn our interactions with other people, we are likely to compare ourselves with them. For example, we compare our abilities, talents, clothes, performance and other qualities. It is the comparison we make with others which determines whether we become more or less confident and therefore, influence how we form our identities."
        },
        {
          "page_number": 27,
          "subtopic": "Individual life skills",
          "content": "This is what is called self-esteem. Self-esteem refers to self evaluation of our abilities, capabilities and worthiness as a result of comparing ourselves with others.\nSelf-esteem can be high or low. High self-esteem comes about when one focuses on positive qualities, and therefore becomes confident. High self-esteem may lead to one being happy, lovely, cooperative, helpful and caring. Low self-esteem is the result of lacking confidence because of comparing ourselves negatively with others. It may lead to one feeling bad and unworthy as well as lacking self-control, and therefore acting helplessly. A person with low self-esteem may also focus on negatives and ignore his or her achievements. He/she would be feeling sad, depressed, angry, ashamed or anxious.\n\n**Self-dependence**\nSelf-dependence is an individual’s ability to make decisions by him or herself. It enables you to manage yourself and hence develop a sense of independence from other people. In order for a person to be self-dependent, he or she must:\n(a) Accept his or her abilities: Each person has to be aware of his or her abilities and potential to perform an activity. In a learning context, students need to recognise their learning abilities and know how to utilise them. For example, they can complete their homework without being too dependent on others.\n(b) Have self identity: Self identity is recognising who one is. In order to achieve this, a person must understand the strengths, weaknesses, goals and resources he or she needs to get where he or she wants to be.\n(c) Develop independent decision-making: Rational decision-making involves identifying options, evaluating available options and choosing the best option. For example, a person who lets friends make decisions for him or her, has less independent decision-making skills. However, it is also important for you to listen to what others tell you, but you have to analyse their ideas before making a decision.\n(d) Clarify his or her value: Value clarification relates to the convictions and beliefs which guide a person in a decision-making process. It raises one’s self-discipline, ability to stay focused as well as commitment to responsibilities.\n(e) Practise independent decision making: Becoming self-dependent is not an overnight process. Through practising independent decision making, a person"
        },
        {
          "page_number": 28,
          "subtopic": "Individual life skills",
          "content": "acquires experiences and becomes confident. However, consulting experienced people may help one to become self independent in making decisions.\n\n**Coping with emotions**\n[FIGURE 3.1: Human faces showing different emotions]"
        },
        {
          "page_number": 29,
          "subtopic": "Individual life skills",
          "content": "We all have emotions. Emotions are inborn physiological conditions that show our reaction to situations or events. There are six basic emotions, namely happiness, sadness, fear, anger, surprise and disgust. These emotions are the strategies for coping with the problems or challenges we face. With respect to activity 3.4, the results are likely to be as follows: 1= happiness, 2=sadness, 3= shock or surprise, 4= fear, 5 anger and 6=disgust.\n\nOn the other hand, feelings are the interpretations of our emotions or other people’s emotions. Feelings can be either positive or negative. Positive feelings include pride, love, joy and hope; while negative feelings include hatred, guilt, shame and jealousy. Inability to handle our emotions and feelings can lead to stress, depression, anxiety and conflict."
        },
        {
          "page_number": 30,
          "subtopic": "Individual life skills",
          "content": "**Ways to cope with emotions**\nCoping with emotions involves:\n(a) Identifying emotions: You need to identify the emotions involved in the situations. For example, ask yourself, are you happy, sad, angry or fearful?\n(b) Identifying the sources of emotions: Knowing the source of your emotional state is necessary to cope with it. A person who is not aware of the source of his or her emotions becomes confused and may not develop coping mechanisms.\n(c) Analysing the effects of the emotions on oneself and others: Analysing the effects of emotions on yourself and others will help you to make the right decisions.\n(d) Assessing your ability to handle emotions: It is absolutely necessary to assess how well you can handle emotions. Good decision-making begins with the ability to handle emotions.\n(e) Refraining from impulsive actions: Emotions may overwhelm and prevent you from making rational decisions. Thus, you need to calm down before confronting your emotions.\n(f) Seeking guidance or counselling: You are encouraged to find counselling services when it is difficult for you to cope with emotions. Some emotions may be difficult to manage, so you have to seek help from the school counsellor or any teacher you trust. For example, when you are sad because of poor performance in your studies, seek counselling services that could help you to get alternative solutions for getting good performance.\n\n**Stress management**\nStress is excessive pressure, tension or worry resulting from problems and life challenges. Students can have stress as a result of family conflicts, the divorce of parents, a low family income, lack of friends and difficulty in coping with the new school environment. It may also be due to lack of interest in a particular subject, too much homework, unsatisfactory academic performance and failure to cope with peer pressure. Symptoms of stress include loneliness, sadness, anxiety, fear and anger. Other signs are lack of appetite, sleeping disorders and worries. Stress management is a conscious effort to minimise or tolerate problems. Failure to cope with stress may lead to mental health problems and other diseases such as high blood pressure, heart diseases and ulcers. In managing stress, a person develops coping mechanisms to reduce negative feelings and emotions caused by"
        },
        {
          "page_number": 31,
          "subtopic": "Individual life skills",
          "content": "peer pressure or the challenges a person is facing. The following are strategies that can help one to reduce, cope with or manage stress:\n(a) Managing time: This is achieved by preparing a timetable or schedule helpful for arranging activities in an organised manner. Having a timetable will help you to get rid of unnecessary stress.\n(b) Living an organised life: As a student, you have to live an organised life which includes having academic notes, handing in assignments on time and meeting all deadlines. Doing that will help you to manage stress.\n(c) Having a positive attitude: Being positive and avoiding focusing on negative aspects of life protects your mental health. For example, instead of being upset about poor grades, be positive and seek ways to improve your performance.\n(d) Finding a social support system: Spend time with friends, other family members and people who love, care about and support you. A strong support system will enable you to share with them negative feelings and pain.\n(e) Exercising and leisure: Physical exercise gives you an opportunity to get rid of your negative feelings.\n\n**Assertiveness**\nThis is the ability to communicate feelings, options and needs. It also includes valuing what others feel and want. Being assertive means being able to stand up for your own and other people’s rights. For example, rejecting a friend’s suggestion to steal school property is being assertive. People who are assertive tend to have satisfying lives because they are good at communication, have self-assurance, free-spirit and are able to influence and guide others.\n\nIn a learning context, assertiveness will help you to do better in academic activities and become an acceptable member of your school. The following techniques could be used to develop and enhance your assertiveness:\n(a) Making positive decisions: Negativity and pressure to be aggressive may lead you into making irrational decisions. You can make rational decisions when you are calm, regardless of the external pressure which has triggered your anger.\n(b) Being open: Sharing your opinions, feelings, wants and needs with others reduces unnecessary stress. However, in the process of sharing them with others, it is important to consider the needs of others.\n(c) Being a good listener: This means giving people the freedom to express their"
        },
        {
          "page_number": 32,
          "subtopic": "Individual life skills",
          "content": "inner feelings and concerns without interfering with their decisions. Listen to them without judging and allow them to express their feelings so that they can develop a sense of trust, love and care.\n(d) Being honest: Tell others the truth by sharing with them your real feelings. Deception may look smart, but may have very painful effects later.\n(e) Respecting others: People need to be treated with decency and politeness. Speaking in a calm and relaxed tone increases your chances of being treated with respect.",
          "exercise": "3.1"
        },
        {
          "page_number": 33,
          "subtopic": "Social life skills",
          "content": "**Social life skills**\nThese are skills which give an individual the knowledge and ability to deal competently with other people’s demands. They help a person to understand and live in peace and harmony with others and develop positive relationships with peers, friends, family members, and others. Social life skills enable someone to live in accordance with acceptable standards and values of a society. They involve forming healthy relationships, resisting peer pressure, and employing empathy, negotiation and effective communication. Such social skills are described in the sections that follow.\n\n**Forming healthy relationships**\nThis is the ability to meet and relate with others in various places such as at school, playing field and social gatherings. To maintain healthy living, humans need healthy relationships that help them to love and behave positively towards each other. Forming healthy relationships is a skill that a person needs to have. Such relationships could be between students and teachers, students and parents, students and peers, and students and the community. This ability starts in the early years of life and promotes personal well-being and peace in society.\n\nAt school, it is common for students to develop friendship for the purpose of sharing hopes, aspirations, fears and other personal and academic issues. When you are at school, you need to be careful with the people you interact with. It is important to avoid bad friendship which may lead you to develop bad behaviour. Such behaviours are like telling lies, alcoholism, drug abuse and smoking, disrespecting people, engaging in early sexual relationships and other immoral acts.\n\n**Qualities of a good friend**\nIndividuals have different personalities, interests, values and goals. Therefore, they differ with respect to the qualities they consider as important in choosing a friend. The following may be some of the general qualities of a good friend:\n**Trust:** Do you trust the person? A friend must be trustworthy, reliable and responsible."
        },
        {
          "page_number": 34,
          "subtopic": "Social life skills",
          "content": "**Empathy:** Does the person understand you? Being empathetic means understanding what others are going through and accepting others as they are without judging them.\n\n**Honesty and openness:** Does the person mean what he or she says to you? Is he or she willing to tell you about his or her academic and social life? A good friend is one who tells you the truth and who is ready to share his or her thoughts and ideas with you.\n\n**Unconditional acceptance:** Does the person judge you? A good friend accepts you as a person, regardless of your status, ethnicity, race, religion or gender. When you are wrong, the person helps and corrects you with love.\n\n**Loyalty:** Is the person ready to defend you in your absence? A good friend protects you even if you are absent.\n\n**Managing peer pressure**\nPeer pressure may make you change your opinion, attitude or behaviour as a result of your intention to belong to the group of people of your age. Peer pressure is common among friends, classmates, schoolmates or neighbours. Peer pressure can be positive or negative. Positive peer pressure influences an individual to do the right things. Positive influence is exemplified by respecting values, going to school every day, studying hard, respecting parents and elders, assisting people with disabilities where possible and visiting sick people. Negative peer pressure influences one to do wrong things as exemplified by behaviours such as drug abuse, sneaking from school, misusing power and not respecting others.\n\nManaging peer pressure means making an effort to manage or sustain other people’s influence that can change your attitude and perspectives on something."
        },
        {
          "page_number": 35,
          "subtopic": "Social life skills",
          "content": "**Strategies for managing peer pressure**\nIt is important for a person to find ways that could help him or her to manage peer pressure. The following are strategies that could help one to manage peer pressure and live peacefully:\n\n**Paying attention to values:** If peers or friends are pressurising you to do something against your values, do not feel ashamed to stand by your standards. Good students have principles regardless of what peers want. For instance, good students cannot allow others to touch their private parts.\n\n**Being thoughtful:** Responding to friends’ requests, views and opinions requires a thoughtful mind. Think about how you would react in different situations and what you would say or do.\n\n**Having a conversation with the person:** It is good idea to be open to someone who is trying to influence you to do something. Letting him or her know how you feel, reduces the tension and the person could stop pressurising you to do something you do not want.\n\n**Communicating with parents:** Parents have the right to know what is going on in their children’s lives. Sharing with parents what your friends or peers ask you to do is important. Parents have the duty to care for and protect their children. If anything happens to children, they are responsible.\n\n**Getting support from others:** The support you get from trusted adults such as teachers or the school counsellors can be the best way of managing peer pressure. A trusted adult can listen to you and give you strategies which might work in your situation."
        },
        {
          "page_number": 36,
          "subtopic": "Social life skills",
          "content": "**Being empathetic**\nEmpathy is the ability to feel what others are feeling and understanding what they are going through. Empathetic people do not assume what others are feeling or impose their views on others. With respect to Activity 3.9, if you agreed with most of the statements, it is likely that you are an empathetic person. Empathy helps us to understand and help others address their problems. A good student needs to be empathetic both at home and at school. At home, empathetic children are usually willing to listen and receive guidance from their parents and siblings. They do not insist that they are right, and ask for forgiveness when they are wrong. At school, empathetic students work collaboratively and prefer to study with others.\n\n**Negotiation skills**\nNegotiation is a communication technique that enables two sides to reach an agreement or compromise."
        },
        {
          "page_number": 37,
          "subtopic": "Social life skills",
          "content": "Read the conversation below and answer the questions that follow.\n\nJames and Maggie are Form One students at Kilimani Secondary School. Their school has enough teachers who support their students all the time. In the weekends, teachers assign their students more homework to do, which keeps them busy at home.\n\nOne Friday, the Civics teacher assigned her students an exercise from the Civics textbook. However, there were a few copies of the book, so students had to share. Maggie and James shared one copy of the book. After school time, James asked Maggie if he could take the book and use it over the weekend. Their conversation went thus:\n\n**James:** Hi Maggie!\n**Maggie:** Hi James. How are you?\n**James:** I’m fine. Can I have the book so that I can use it over the weekend?\n**Maggie:** Oh no! I need to use it. Remember that I’m the bookkeeper!\n**James:** Haven’t you finished yet? I saw you doing the exercise and thought that you had finished.\n**Maggie:** No, I haven’t.\n**James:** What if we come to school tomorrow and share the book?\n**Maggie:** No, James. I’ve certain chores to do at home.\n**James:** Okay. How long will it take for you to finish the chores and the homework?\n**Maggie:** I’ll be done by 3:00 PM, hopefully.\n**James:** So, can I come to your place to pick up the book at 4:00 PM?\n**Maggie:** Yes, you can.\n**James:** Thank you, Maggie. Have a nice evening.\n**Maggie:** Thank you too, James.",
          "exercise": "3.2"
        },
        {
          "page_number": 38,
          "subtopic": "Social life skills",
          "content": "**Effective communication skills**\nCommunication is a process by which two or more people share information. The shared information usually comprises facts, knowledge or emotions. Communication can be verbal or non-verbal. Verbal communication takes place when a person uses spoken or written words to send information. Non-verbal communication takes place when a person sends a message without using spoken or written words. Oral communication can be done by phone, face to face, radio and television. Written communication, on the other hand, is done through written texts, electronic mails, faxes, messages and newspapers. In non-verbal communication, people communicate through gestures, facial expressions, finger spelling, postures and eye contact.\n\nCommunication is effective when the two sides actively share information without undermining either side. Each side must provide feedback to the other side. Effective communication helps an individual to clarify ideas, correct mistakes and reduce stress. Effective communication can be achieved if there is clarity of the message, appropriate language is used, time is observed, there is attentive listening and questions are asked and answered.\n\n**Entrepreneurship skills**\nEntrepreneurship skills mean the ability to transform ideas into actions by solving problems, being creative, innovative and taking risks. Entrepreneurship gives a student an opportunity to think outside the box, nurtures unconventional talent and instils confidence and the spirit of engaging in entrepreneurial activities. A student with entrepreneurship skills learns to translate ideas into actions in order to solve simple socio-economic challenges and hardships. In order to be an entrepreneur, one should have the following skills:\n**Problem-solving skills:** Entrepreneurship begins with solving a real-life problem. An entrepreneur sees every problem as an opportunity.",
          "exercise": "3.3"
        },
        {
          "page_number": 39,
          "subtopic": "Social life skills",
          "content": "**Interpersonal skills:** Entrepreneurship requires ability to relate with people. In doing so, it takes into account leadership, motivation, communication and listening and the ability to negotiate and form relationships with others.\n\n**Creative and critical thinking skills:** To identify opportunities, one needs to think critically. Critical thinking is achieved by analysing information to create better ideas. In developing critical thinking, one needs to read books and magazines, and get information from other people and the Internet.\n\n**Practical skills:** An individual with an entrepreneurial mind sets goals, makes plans and rational decisions based on relevant information. Therefore, one cannot be a successful entrepreneur without practising what he or she knows.\n\n**Team-working**\nStudy the pictures in figure 3.2 and 3.3 and answer the questions that follow.\n\n[FIGURE 3.2: Students fetching water]"
        },
        {
          "page_number": 40,
          "subtopic": "Social life skills",
          "content": "[FIGURE 3.3: Students planting trees]\n\nTeamwork is a process through which a number of individuals with common goals or desires collaborate to do something. During the collaboration, group members can share their knowledge, skills and resources. People work together to address",
          "exercise": "3.4"
        },
        {
          "page_number": 41,
          "subtopic": "Social life skills",
          "content": "various socio-economic and political problems. In the school environment, every student needs to develop the tendency of cooperating with others to perform both formal curricular and extra-curricular activities so as to achieve personal and school goals. Teamwork helps an individual to achieve deeper learning that develops skills and competencies. Since teamwork enables members to learn from each other, it builds self-esteem, reduces stress and develops social life skills."
        },
        {
          "page_number": 41,
          "subtopic": "Effective decision-making skills",
          "content": "**Effective decision-making skills**\nEffective decision-making skills refer to a person’s ability to use information to develop appropriate alternatives and predict the consequences of the choices he or she makes. Some students may not know what they want and of their future careers. This is because they lack effective decision-making skills. Effective decision-making skills help students to improve their self-efficacy, confidence and self-discipline. Effective decision-making skills make use of the following key aspects:\n\n**Creative thinking:** This is the ability to come up with diverse ideas and a unique way of doing things. Creative thinking helps a person to get rid of a bad thing, to confront challenges and make the right decisions. Creative thinking also helps one to assert oneself in different situations.\n\n**Critical thinking:** This means the ability to process information so as to analyse, evaluate and synthesise new ideas. One needs to be critical to confront challenges and adapt to an environment. Critical thinking helps a person to identify problems in his or her environment to develop ideas for effective problem solving.\n\n**Decision-making:** This refers to the ability to make the best choice out of the available options or alternatives. The best choice is usually made after considering its consequences. In life, it is important to think about consequences before making a decision. The skill helps a person to choose the best option from available alternatives and develop confidence.\n\n**Problem-solving:** This is the ability to find solutions for pressing issues facing an individual or a society. Problem-solving requires one to identify problems and come up with solutions to the problems."
        },
        {
          "page_number": 41,
          "subtopic": "Promoters of life skills",
          "content": "**Promoters of life skills**\nSkills are both inborn and acquired. While some people have natural skills, others learn skills through formal training or interaction with other people. The following agents promote life skills among children:"
        },
        {
          "page_number": 42,
          "subtopic": "Promoters of life skills",
          "content": "**Family:** In families, it is parents, guardians and relatives who are responsible for teaching and raising their children. Children learn most of their life skills from their family members, relatives and guardians. As children grow up, parents teach them how to wash clothes, cook and how to stand on their own in times of challenges or problems. Therefore, children are required to listen to their parents and do the chores they are assigned so as to develop their life skills.\n\n**Neighbours:** These are people living close to our homes. Sometimes neighbours may play a role in moulding our moral values and life skills. Good children learn proper behaviour and avoid improper behaviour which may affect their personal development.\n\n**Friends or peers:** Children’s interaction with different friends and peers helps them to acquire new knowledge and skills. They acquire some life skills either by observing or working with them. For example, through group discussions or teamwork, they learn to confide, negotiate, communicate and make decisions. Working with friends also gives them a chance to acquire skills which they may not have learnt in their families.\n\n**School:** At school, children learn and develop skills of different kinds. It is expected that the knowledge and skills acquired will be useful in their daily lives. Schools teach students skills such as how to be good leaders, empathetic, hard workers and how to build and maintain good friendships. These skills promote their well-being and academic performance.\n\n**Society:** Since children live with others, they learn good manners, good behaviour and skills through interacting with others. This helps them to shape their natural abilities and acquire new knowledge and skills. It is the society that teaches them the skills which are not included in the school curriculum.\n\n**Religion:** Religious teachings sharpen children’s behaviour and conduct to become acceptable members of their societies. Religious institutions promote critical thinking, empathy, values, organisational skills, management, communication and team-working skills.\n\n**Government:** The government imparts life skills to its people through educational programmes. The government has institutions such as schools, colleges and others which organise professional development programmes to educate people about civic responsibilities.\n\n**Non-governmental organisations and UN agencies:** These are organisations which provide social services to people. They initiate different programmes aimed at promoting life skills among the youth. Through these organisations, the youth learn"
        },
        {
          "page_number": 43,
          "subtopic": "Promoters of life skills",
          "content": "life skills pertaining to problem-solving, teamwork, emotions or stress management, communication, healthy relationships and management of peer pressure. Some of the organisations which promote life skills among the youths in our country include the United Nations Educational, Scientific and Cultural Organization (UNESCO), the United Nations Children’s Fund (UNICEF), the United States Agency for International Development (USAID), World Vision, Save the Children, Plan International, Tanzania Gender Networking Programme (TGNP), HakiElimu, Twaweza, the Anti-Female Genital Mutilation Network of Tanzania, Tanzania Women Lawyers’ Association (TAWLA), Tanzania Media Women’s Association (TAMWA) and the Medical Women Association of Tanzania (MEWATA).",
          "exercise": "3.5"
        },
        {
          "page_number": 44,
          "subtopic": "Importance of life skills",
          "content": "**Importance of life skills**\nLife skills are very important. This is because they help one to make informed decisions, avoid risky behaviour, establish and maintain good relationships, and develop good communication skills.\nGenerally, life skills are important in the following ways:\n(a) Promoting understanding on how to work with a community in good faith and integrity;\n(b) Developing ability to deal with various life issues such as HIV/AIDS and COVID 19;\n(c) Promoting good behaviour in the classroom, self-awareness, and social and emotional adjustment;\n(d) Promoting conflict resolution and bringing people together;\n(e) Empowering the younger generation to face challenges; and\n(f) Promoting healthy personal attitudes such as self-esteem, confidence, self-awareness and gender sensitisation."
        },
        {
          "page_number": 44,
          "subtopic": "How to use life skills",
          "content": "**How to use life skills**\nLife skills enable a person to live with others peacefully. We can use life skills in the following ways:\n(a) Enabling one to know how to relate to others;\n(b) Maintaining good hygiene and sanitary conditions in our surroundings;\n(c) Creating awareness among young people so that they spend their time doing useful activities and refrain from developing risky behaviours;\n(d) Developing effective policies which promote human rights; and\n(e) Engaging in effective communication to establish good relationships with other people. It is through effective speaking, writing and listening that a person can establish good relationships with others."
        },
        {
          "page_number": 44,
          "subtopic": "Consequences of not using life skills",
          "content": "**Consequences of not using life skills**\nFailure to use life skills may result into the following consequences to an individual:\n**Health problems:** A person who does not cope with stress may suffer from heart disease, headaches, high blood pressure, depression and anxiety, and may want to commit suicide which can lead to death. In addition, lack of self-awareness, self-control and self-worth may cause a person to suffer from STDs. Sometimes, failure to avoid peer pressure may cause one to engage in risky behaviour such as drug abuse and prostitution."
        },
        {
          "page_number": 45,
          "subtopic": "Consequences of not using life skills",
          "content": "**Existence of conflicts in society:** Conflicts and misunderstandings can arise if people fail to communicate, negotiate or solve problems. In addition, failure to build and maintain positive relationships leads to conflicts with others.\n\n**Poor academic performance:** In a learning context, students with low self-esteem and poor problem-solving skills are more likely to fail to make decisions on how to study and may have poor performance. Similarly, lack of a teamwork spirit among students can lead to poor performance.\n\n**Stagnation of personal and national development:** Life skills are fundamental to personal and national development. A society with people who are not critical and creative and who cannot make good decisions about their personal and national economy always live in poverty. Furthermore, people who cannot develop alternative solutions to economic challenges and difficulties become a burden to others."
        },
        {
          "page_number": 45,
          "subtopic": "Consequences of not using life skills",
          "content": "",
          "revision_exercise": "3"
        }
      ]
    },
    {
      "chapter_number": 4,
      "chapter_title": "Human rights",
      "introduction": "Every human being deserves to enjoy rights regardless of his or her race, sex, nationality, ethnicity or religion. In this chapter, you will learn about aspects of human rights, the importance of human rights and the relationship between human rights and provision of social services. You will also learn the role of government and interest groups in promoting human rights, the limit of individual human rights and human rights abuse. The competencies developed will help you to respect human rights. You will also be able to stand for your rights and the rights of others.",
      "pages": [
        {
          "page_number": 48,
          "subtopic": "Meaning of human rights",
          "content": "**Meaning of human rights**\nHuman rights refer to basic and fundamental rights that all human beings are entitled to because they are human beings. In brief, human rights are the basic needs and freedom that every person has from birth to death. They are inherent in a person by virtue of birth and they can never be taken away. However, sometimes they can be restricted, but should not be arbitrarily restricted by any law.\n\nIn Tanzania, most of these rights are incorporated in the country’s constitution. The enactment of those rights in the Constitution of the United Republic of Tanzania is mere evidence of their recognition and the intention that they should be enforced in a court of law. Examples of human rights include the right to education, right to equality before the law, the right to life, right to personal freedom, right to privacy and personal security, right to freedom of movement, freedom of religion, person’s freedom of association, right to participate in public affairs, right to work, right to remuneration and right to own property."
        },
        {
          "page_number": 48,
          "subtopic": "Universal Declaration of Human Rights",
          "content": "**Universal Declaration of Human Rights**\nOn 10th December 1948, the United Nations (UN) introduced the Universal Declaration of Human Rights (UDHR). The declaration was drafted by people from different legal and cultural backgrounds. The aim of the declaration was to make sure that human rights are universally recognised and all countries adapt, promote"
        },
        {
          "page_number": 49,
          "subtopic": "Universal Declaration of Human Rights",
          "content": "and protect them. Most of the member states of the United Nations ratified at least part of the declaration and some bills of rights were included in their national constitutions. The bill of rights provides specific rights and freedoms to citizens and limits the power of the government to infringe human rights. It also stipulates the duties of every citizen. This is because rights have a close relationship with duties. Examples of duties are obedience of the law, paying taxes, participating in work and protection of the nation and its resources. Also, every citizen has the duty to participate responsibly, honestly, lawfully, and productively as well as to safeguard public property."
        },
        {
          "page_number": 49,
          "subtopic": "Types of human rights",
          "content": "**Types of human rights**\nThe Universal Declaration of Human Rights includes two types of human rights, namely, legal rights and moral rights.\n\n**Legal rights:** These are individual and group entitlements which are recognised by the constitution of a nation and which can be enforced in the courts of law. Therefore, they are legally protected. Right to life is one example of such rights.\n\n**Moral rights:** These are the values and freedom which are recognised by certain societies or communities; they cannot be proved or claimed in the courts of law, since they are only socially recognised. For example, the right to be treated with respect."
        },
        {
          "page_number": 49,
          "subtopic": "Categories of legal human rights",
          "content": "**Categories of legal human rights**\nThe categories of legal human rights are elaborated in the sections that follow."
        },
        {
          "page_number": 49,
          "subtopic": "Categories of human rights",
          "content": "**Civil and political rights**\nCivil and political rights are the rights and privileges which a state creates for its people, and thus every person deserves to enjoy them. Civil and political rights include the right to life, the right to nationality, the right to equality before the law, freedom from torture and inhuman treatment, freedom from slavery and the right to fair trial. Others are the right to own property, the right to be given a fair public hearing, the right to be considered innocent until proven guilty by a court of law, freedom of movement, freedom to live in any country, the right to seek and enjoy asylum in other countries and freedom of thought, conscience and religion.\n\nMoreover, civil and political rights include the freedom to have one’s own opinions and to express oneself, freedom of assembly, the right to take part in the government of one’s country, the right to have equal access to public services in one’s country and the right to vote and to be voted for. [FIGURE 4.1: Community members expressing their opinions]"
        },
        {
          "page_number": 50,
          "subtopic": "Categories of human rights",
          "content": "**Economic, social and cultural rights**\nThese rights are to do with people’s lives; that is, they are about work and the necessities of life. These rights include the right to work, the right to have a good working environment, the right to fair remuneration and the right to an adequate standard of living. They also include the right to form and join trade unions, the right to collective bargaining, the right to participate in cultural life as well as the right to enjoy the benefits of scientific progress. They also include the right to education, the right to security and the right to rest and leisure as well as reasonable limit of working hours and periodic holidays or annual leave with pay. These rights are the result of the fight against exploitation, oppression and people’s desire for a better standard of living.\n\n**Environmental and developmental rights**\nThese rights relate to the need for a clean and safe environment, for the well-being of people. These rights mean that people have the right to live in a clean environment free from pollution and protected from destruction. They include the rights to peace,"
        },
        {
          "page_number": 51,
          "subtopic": "Categories of human rights",
          "content": "development and equal enjoyment of the common heritage of humankind. These rights also recognise the cultures of different groups in society and advocate for the development of all members of society. These rights came into existence because of the reality that some rights cannot be enjoyed as individual rights. However, an individual enjoys them as a result of being part of a group or community.",
          "exercise": "4.1"
        },
        {
          "page_number": 51,
          "subtopic": "Importance of human rights",
          "content": "**Importance of human rights**\nHuman rights are important because they guarantee people’s freedom, liberty, enjoyment of life and security. Without them, human life would be neglected leading to oppression and chaos. Specifically, human rights are important in the following ways:"
        },
        {
          "page_number": 52,
          "subtopic": "Importance of human rights",
          "content": "(a) They promote equality between men and women, and respect for human dignity;\n(b) People are free to own property and have the right to protect them in accordance with the law;\n(c) When human rights are observed, people get education, participate in political activities and work to become productive for national development;\n(d) They enable a government to serve its people equally and assist those who are in need. Governments are required to provide equal access to social services such as education and health to their people;\n(e) Citizens in the community are free to participate in the process of making decisions for their well-being and the development of the nation;\n(f) Human rights enable people to practise a religion of their choice;\n(g) They also enable people to enjoy freedom of association and develop personal security;\n(h) Human rights promote equality before the law; and\n(i) Human rights promote the right to life. This is important in any society because people will respect others’ right to life and let them live free."
        },
        {
          "page_number": 52,
          "subtopic": "Relationship between human rights and the provision of basic needs",
          "content": "**Relationship between human rights and the provision of basic needs**\nBasic needs are things which are essential for the survival of human beings. They include food, shelter and clothing. Human rights are related to basic needs in various ways.\n\nThe provision of basic needs implies the promotion of human rights. If there are no basic needs, then there are no human rights, and thus no life. Human rights include right to food, shelter and clothing. They also include right to clean water and health services, access to education, transport services and the right to live and enjoy civil rights. Human rights relate to social, economic and cultural activities that can help an individual meet his or her basic needs.\n\nA person cannot demand other human rights such as civil and political rights, economic, social and cultural rights as well as environmental rights without having the basic needs and other social necessities such as education, health and water."
        },
        {
          "page_number": 53,
          "subtopic": "Relationship between human rights and the provision of basic needs",
          "content": "",
          "exercise": "4.2"
        },
        {
          "page_number": 53,
          "subtopic": "Role of the government in promoting human rights in Tanzania",
          "content": "**Role of the government in promoting human rights in Tanzania**\nThe Government of Tanzania promotes human rights to encourage people to respect and value human rights. The government plays various roles in promoting and protecting human rights.\n\nThe government identifies and includes human rights in the Constitution of the United Republic of Tanzania. The government also ratifies international agreements on human rights and instruments which set up the standards and limits of human rights. For example, the Universal Declaration of Human Rights (UDHR) of 1948, the Convention for the Elimination of all forms of Discrimination Against Women (CEDAW) of 1979 and the African Charter on Human and People’s Rights (ACHPR).\n\nMoreover, the government established the Commission for Human Rights and Good Governance (CHRGG) in 2001. The Commission raises people’s awareness of human rights and investigates violations of human rights. It receives and investigates complaints about abuse of human rights. It also acts as an advisory organ on issues pertaining to human rights and good governance to the government and the private sector.\n\nFurthermore, the Constitution of the United Republic of Tanzania allows for the practice of multiparty politics, whereby people are free to join political parties of their choice. Multiparty democracy provides civil and political rights to citizens.\n\nLikewise, the government promotes human rights by practising the rule of law. This means that no one is guilty until he or she has been proven guilty by a court of law. It also means that nobody is above the law."
        },
        {
          "page_number": 53,
          "subtopic": "Role of NGOs and the media in promoting human rights",
          "content": "**Role of NGOs and the media in promoting human rights**\nNon-Governmental Organisations (NGOs) refer to organisations that are not owned by the government. Normally, NGOs observe, cross check, promote and protect"
        },
        {
          "page_number": 54,
          "subtopic": "Role of NGOs and the media in promoting human rights",
          "content": "human rights through their activities. For instance, the Tanzania Media Women Association (TAMWA) helps women to fight against violence in the society. TAMWA assists women and other ways of fighting against violence. These ways include condemning and fighting against gender-based violence, female genital mutilation, teenage pregnancies, child abuse, the inheritance of widows, rape, assault and child marriage. TAMWA promotes women’s and children’s rights projects and has set up advisory centres where women go for legal advice and counselling. Other NGOs like the Medical Women Association of Tanzania (MEWATA) also helps women with health problems to get various services for improving their health and social well-being.\n\nLikewise, Legal and Human Rights Centre (LHRC) conducts research and publishes reports on human rights practice in Tanzania. The LHRC is responsible for empowering the public, promoting, strengthening and maintaining human rights and good governance in Tanzania. Furthermore, Tanzania Women Lawyers’ Association (TAWLA) provides legal assistance to women and the society at large. Religious institutions also promote and protect human rights. They preach about peace and love and equality among people despite their religious differences. Moreover, media outlets like the radio and television educate people on how to promote and advocate for human rights.",
          "exercise": "4.3"
        },
        {
          "page_number": 55,
          "subtopic": "Individual human rights",
          "content": "**Individual human rights**\nIndividual human rights are the basic rights or entitlements that a person has as a human being. They are also called natural rights because everybody is born with them. They are also referred to as unchallengeable rights because they are God-given rights and cannot be taken away either by a government or by other people in a society. Examples of individual rights are the right to life, the right to liberty, right to live a happy life and right to freedom of movement."
        },
        {
          "page_number": 55,
          "subtopic": "Protection of individual rights",
          "content": "**Protection of individual rights**\nThere are various ways in which individual rights can be protected. These include having a constitution and institutions which ensure equal and fair practice of individual rights. A democratic constitution must include individual rights and establish legal institutions advocating for individual rights. In the case of Tanzania, the individual rights are included in the Constitution of the United Republic of Tanzania. In addition, it shows the way in which the Parliament, Judiciary and Executive should advocate for and protect individual rights.\n\nThe media plays a significant role in promoting the protection of individual rights. It informs the public about the violation of individual rights for the relevant institutions to act accordingly.\n\nThe presence of organisations like Amnesty International is another way of protecting individual rights. Amnesty International is a global movement of more than seven million people in the world which evaluates human rights practices in various countries around the world.\n\nMoreover, religious institutions can ensure that individuals enjoy their rights and no person, government or institution violates the rights. The establishment of government institutions that deal with human rights protection is another way of protecting individual rights. The Commission for Human Rights and Good Governance is a case in point. Furthermore, practising the rule of law is another way of protecting individual rights."
        },
        {
          "page_number": 55,
          "subtopic": "Limiting individual rights",
          "content": "**Limiting individual rights**\nLimiting individual rights means restricting the exercise of human rights. It shows what a person should not do while exercising his or her rights. It is a boundary between one’s rights and other people’s rights. Human rights are limited to maintain public order or the general welfare of a democratic society. In a democratic society, people are entitled to exercise their individual rights. Individual rights can be restricted if they interfere with the rights of other people."
        },
        {
          "page_number": 56,
          "subtopic": "Limiting individual rights",
          "content": "Individual rights are limited in the following ways:\n(a) The person should not exercise his or her rights to the extent that it interferes or restricts other people’s rights or public interests; and\n(b) The exercise of individual rights should not render unlawful to any existing law or enactment of any law or the doing of any unlawful act in accordance with such law."
        },
        {
          "page_number": 56,
          "subtopic": "Purposes for limiting individual rights",
          "content": "**Purposes for limiting individual rights**\nSome purposes for which individual rights may legitimately be limited include the following:\n(a) **Protecting the rights of others:** This happens when a conflict of rights occurs, certain rights sometimes need to be limited in order to protect the rights of others. For example, the right to freedom of expression may be limited by the need to respect the right of reputation of others.\n(b) **Protection of public health:** Protecting public health envisages situations where, for example, someone who suffers from epidemic disease may have their freedom of movement restricted in order to protect other people against the risk.\n(c) **National security:** Freedom of movement may be restricted if it interferes with the protection of the state’s security in some circumstances. Similarly, publishing government secrets, in exercise of freedom of expression, can be harmful to state security.\n(d) **Public morals:** The protection of public morals is sometimes cited as a reason to limit individual’s rights. For example, it may be used to limit freedom of expression in the interests of regulating inappropriate films.\n(e) **Maintain social peace and harmony:** Peace and harmony can bring a peaceful and stable order to society, and they are a necessary condition for the survival and development of mankind. For the purpose of maintaining peace in the society, the freedom of religion may be restricted. For example, in Tanzania, if a person utters words with intent to wound other religious feelings while at the same time claiming to have been guaranteed freedom of opinion or religion, is prohibited.\n(f) **Restriction may be done to fulfil specific purposes:** The right to personal liberty may sometimes be limited if one is convicted of a crime in accordance"
        },
        {
          "page_number": 57,
          "subtopic": "Purposes for limiting individual rights",
          "content": "with fair trial and the rule of law."
        },
        {
          "page_number": 57,
          "subtopic": "Conditions which may hinder the implementation of individual rights",
          "content": "**Conditions which may hinder the implementation of individual rights**\nThe following are the conditions which can hinder the effective implementation of individual rights:\n(a) An individual may fail to exercise one’s rights when there is a war or insecurity in a society or community;\n(b) Lack of integrity and decline of professional ethics on the part of the judicial personnel;\n(c) Bias and unfair treatment from the decision making machinery (Sometimes this situation may occur at an individual level on the basis of race, religion, tribe and economic status);\n(d) Lack of awareness about human rights which could enable an individual to recognise and fight for his or her rights;\n(e) Corruption practices which deny people’s rights;\n(f) Ignorance of the legal procedures and appropriate steps to be taken; and\n(g) Inadequate political rights. This may happen when citizens are denied their rights to participate in voting and in public affairs.",
          "exercise": "4.4"
        },
        {
          "page_number": 58,
          "subtopic": "Human rights abuse",
          "content": "**Human rights abuse**\nHuman rights abuse is unlawful prevention of a person’s enjoyment of his or her rights as stipulated by a law or constitution. The violation of someone’s rights means treating the person as if she or he is not a human being. Abuses of human rights include all actions by an individual, a group of people or a government which lead to the violation of human rights. Abuses of human rights can take place at the level of an individual, family, society and government.\n\nAt family level, for example, parents can abuse the rights of children by denying them basic needs such as food, clothing, shelter, and proper education; and forcing their children to marry, contrary to their wish, especially at a young age and giving excessive corporal punishment.\n\nThe governments can also abuse human rights through the following ways:\n(a) If the law enforcing machinery does not discharge its functions in accordance with the law;\n(b) Using military force to torture civilians who demand their rights;\n(c) Making arbitrary laws that limit the exercise of individual rights;\n(d) Citizens are discriminated against on the basis of their race, gender, religion or ethnicity;\n(e) Disrespecting a bill of rights; and\n(f) Not maintaining the rule of law."
        },
        {
          "page_number": 59,
          "subtopic": "Human rights abuse",
          "content": "",
          "exercise": "4.5"
        },
        {
          "page_number": 59,
          "subtopic": "Effects of human rights abuse",
          "content": "**Effects of human rights abuse**\nThere are various effects of abusing human rights. These are described below.\n\nThe increase of unlawful acts such as a person being deprived of his or her property without the authority of law and fair compensation. This situation may lead to a person losing his or her right to own property, which is very important for personal and national development.\n\nHuman rights abuse also leads to discrimination especially in socio-economic and political aspects. People will be denied their rights to work, to own property or join any association or organisation because of the ideology of that association. Also, people will be discriminated against on the basis of tribe, religion, race and gender, leading to unequal access to social services such as education, health and right to participate in decision making.\n\nMoreover, unrest and instability in society may happen as a result of conflicts arising after human rights have been abused. The conflicts can be between citizens and their government which may prevent citizens from doing their activities freely and peacefully. Sometime the conflicts may limit the right of personal freedom and right to life because of the injuries and deaths that may occur due to the conflicts."
        },
        {
          "page_number": 60,
          "subtopic": "Effects of human rights abuse",
          "content": "In addition, injuries, pain or death can also occur because of human rights abuse. Good examples of such effects may be when a man or a woman beats his or her spouse, hence depriving that person to live a happy life.\n\nFinally, an angry mob may decide to kill a person who is suspected of stealing or being involved in witchcraft. These acts may lead to someone losing his or her right to life because of being killed."
        },
        {
          "page_number": 60,
          "subtopic": "Ways to combat human rights abuse",
          "content": "**Ways to combat human rights abuse**\nHuman rights abuse can be prevented and combated if the following steps are taken:\n(a) People should respect each other, including the sick and people with disabilities;\n(b) All people should be treated fairly and equally before the law and none should be discriminated against because of race, religion, gender or economic status;\n(c) The government should maintain the rule of law to avoid abuse of human rights;\n(d) The government should educate its citizens about their rights so that they can claim them when violated;\n(e) Law enforcement agencies must respect and protect human dignity, maintain and uphold human rights of all persons while discharging their duties;\n(f) The government must be transparent in the way it carries out its activities and people should be informed about important matters going on in their government;\n(g) Religious institutions should preach against bad social practices such as rape, theft, murder, wife beating, banditry and corruption which are against human rights;\n(h) Any person who has a reason to believe that violation of human rights has occurred or is about to occur must report the matter to the police or any other authorities; and\n(i) The Commission for Human Rights and Good Governance which is the government department vested with mandate to promote and protect human rights, must educate the public about its role of promoting, preserving and protecting human rights."
        },
        {
          "page_number": 61,
          "subtopic": "Ways to combat human rights abuse",
          "content": "",
          "exercise": "4.6"
        },
        {
          "page_number": 61,
          "subtopic": "Ways to combat human rights abuse",
          "content": "",
          "revision_exercise": "4"
        }
      ]
    },
    {
      "chapter_number": 5,
      "chapter_title": "Responsible citizenship",
      "introduction": "It is important for an individual who lives in Tanzania to be a responsible citizen. In this chapter, you will learn about the concepts of citizen and citizenship, and importance and responsibilities of a citizen. You will also learn about responsibilities of citizens to special groups. The competencies developed will enable you to fulfil your responsibilities as a citizen and become a good and responsible citizen of Tanzania.",
      "pages": [
        {
          "page_number": 63,
          "subtopic": "Meaning of citizen and citizenship",
          "content": "**Meaning of citizen and citizenship**\nA citizen is a legal member of a nation who owes allegiance to and is entitled to be protected by a sovereign state. Citizenship on the other hand is a person’s legal right to belong to a particular country. It is the status of a citizen and related duties, rights and privileges, for example, participating in community work, volunteering to do something and making the efforts to improve the quality of lives of all citizens. A responsible citizen is the one who fulfils his or her duties and responsibilities in society. A citizen of a given country is expected to be loyal and patriotic."
        },
        {
          "page_number": 63,
          "subtopic": "Types of citizenship",
          "content": "**Types of citizenship**\nIn Tanzania, there are three main types of citizenship: citizen by birth, naturalisation and descent (kinship). These are explained in the following sections.\n\n**Citizenship by birth**\nA person who is born in Tanzania and whose parents are Tanzanians becomes a citizen of Tanzania. Every person who is born in Tanzania is entitled to a birth certificate. Birth certificates are issued by the Registration Insolvency and Trusteeship Agency (RITA). The birth certificates issued show important information such as the place of birth, the sex and name of the child, the name of the father, the mother, the date and country of birth of the child. The information is important when an individual"
        },
        {
          "page_number": 64,
          "subtopic": "Types of citizenship",
          "content": "needs various services inside and outside the country. [FIGURE 5.1: A sample of birth certificate issued in Tanzania]\n\n**Citizenship by naturalisation or registration**\nA person who was born outside Tanzania and wishes to be a citizen of Tanzania, may apply for citizenship to the Ministry of Home Affairs through the Immigration Department. Naturalisation means a person voluntarily seeks to be a citizen of another country. Citizenship by naturalisation is sometimes known as citizenship by registration. Citizenship by registration is only granted to a person from a Commonwealth country and to any female applicant who is married to a Tanzanian man, even if she does not belong to a Commonwealth country. Commonwealth countries include all countries ever ruled by the British such as Bangladesh, Sri Lanka, New Zealand, India, Kenya, Uganda, Tanzania and Zimbabwe.\n\nUpon sending an application for citizenship by naturalisation, the Ministry through the Immigration Department, publishes a notice in newspapers bearing the photograph and names of the applicant. The notice informs the public of the"
        },
        {
          "page_number": 65,
          "subtopic": "Types of citizenship",
          "content": "application and asks if anyone has any objection against the applicant being granted citizenship. If there are no objections, the application is accepted and the applicant is granted citizenship. The following are the conditions which an applicant must fulfil so as to be granted citizenship according to the Tanzania Citizenship Act, Chapter 357, (Revised Edition, 2002):\n(a) He or she has resided in the United Republic of Tanzania throughout a period of twelve months immediately preceding the date of application;\n(b) He or she must automatically denounce his or her earlier citizenship and must state that he or she intends, if he or she is naturalised, to reside permanently in the United Republic of Tanzania;\n(c) During the ten years immediately preceding the said period of twelve months, the applicant has resided in the United Republic of Tanzania for periods amounting in aggregate to not less than seven years;\n(d) He or she is of good character and must be loyal to the Constitution of the United Republic of Tanzania;\n(e) In terms of past and potential contribution to the national economy or scientific and technological advancement and to the national social and cultural welfare, he or she would be a suitable citizen of the United Republic of Tanzania; and\n(f) He or she has adequate knowledge of Kiswahili and English.\n\n**Citizenship by descent or kinship**\nThis type of citizenship is applicable to a person who was born outside Tanzania but one whose parents are citizens of Tanzania. The person has to apply to the Ministry of Home Affairs for confirmation of his or her citizenship."
        },
        {
          "page_number": 65,
          "subtopic": "Privileges of citizenship",
          "content": "**Privileges of citizenship**\nThe privileges of being a citizen of a particular country include the following:\n(a) Citizenship enables a person to use his or her legal rights in the country and to enjoy freedom granted to citizens only;\n(b) It enables a person to get services which are provided to citizens only such as education, health, food supply and government guarantees;\n(c) It gives a person the right to participate in political, economic and social activities in the country, for example, voting for leaders and being voted for;"
        },
        {
          "page_number": 66,
          "subtopic": "Privileges of citizenship",
          "content": "(d) It enables someone to get a passport or visa; and\n(e) It is useful in various legal and official matters related to getting employment in public offices and military services."
        },
        {
          "page_number": 66,
          "subtopic": "Conditions which can cause a person to lose his or her citizenship in Tanzania",
          "content": "**Conditions which can cause a person to lose his or her citizenship in Tanzania**\nA person who acquired his/her citizenship by registration or by descent may lose it if:\n(a) The government is satisfied that the person obtained the certificate of registration by means of fraud, false representation or the concealment of any material fact;\n(b) The person has committed a crime such as treason, sabotage or fraud;\n(c) The person denounces his or her Tanzanian citizenship;\n(d) The person holds dual citizenship, for example, he or she is a citizen of Tanzania and at the same time has citizenship of another country;\n(e) The person has shown by act or speech to be disloyal to the United Republic of Tanzania; and\n(f) The person has ordinarily been resident in a foreign country for a continuous period of five years."
        },
        {
          "page_number": 66,
          "subtopic": "Consequences of staying or living in a country without being a citizen",
          "content": "**Consequences of staying or living in a country without being a citizen**\nThe following are consequences of staying or living in a certain country without being a citizen of the country:\n(a) The person will not have protection while living in the country, consequently he or she will put his or her life at a risk of insecurity;\n(b) The person will not have the freedom of expression and movement, and other rights;\n(c) People will consider an individual who is illegally staying in a country as an enemy and a criminal;\n(d) The person will not be involved in important activities for his or her own development and the development of the country; and\n(e) A non-citizen will not be employed in sensitive areas such as in the military and ministries for security reasons."
        },
        {
          "page_number": 67,
          "subtopic": "Consequences of staying or living in a country without being a citizen",
          "content": "",
          "exercise": "5.1"
        },
        {
          "page_number": 67,
          "subtopic": "Civic responsibilities",
          "content": "**Civic responsibilities**\nResponsibilities are activities and duties which a person has to perform. A citizen has duties to perform in the country to which he or she belongs. These duties are called civic responsibilities. Civic responsibilities mean active participation in the public life of a society in a committed and constructive manner. They may be categorised into three groups, namely, political, social and economic responsibilities.\n\n**Political responsibilities:** This category includes activities such as voting during elections, volunteering to do various activities in the community and participating in local and national political party rallies. It also involves discussing various issues and holding public office. Moreover, it includes participating in government activities and giving opinions on government matters, contesting for leadership positions at the local or national level and monitoring the government so that it does not abuse power. Every citizen has the duty to observe and abide by the Constitution and other laws of the country. It is the duty of the citizens to protect, preserve and maintain the independence, sovereignty, territory and unity of the nation. [FIGURE 5.2: Citizens casting votes during general election.]"
        },
        {
          "page_number": 68,
          "subtopic": "Civic responsibilities",
          "content": "[FIGURE 5.2: Citizens casting votes]\n\n**Economic responsibilities:** This category includes doing lawful productive work, participating in community development activities, participating in preventing and reporting various types of crimes and safeguarding public property. Safeguarding public property involves protecting the natural resources of the country and all public assets. It also includes doing activities related to paying tax and other statutory payments honestly and on time.\n\n**Social responsibilities:** This category includes promoting fairness, equality and social justice. Others are respecting the rights of fellow citizens and obeying the law so that everyone can live in peace and harmony. Citizens are also expected to serve in the national armed forces such as the Tanzania People’s Defence Forces (TPDF), the National Service, the Police, the Prisons and the Immigration Department to safeguard the sovereignty of the country. Furthermore, citizens are required to be loyal to the nation, and preserve and protect the environment in which they live. In addition, they are expected to support special groups such as the elderly, street children, refugees, women, children and people with disabilities such as the deaf and those suffering from mental illness."
        },
        {
          "page_number": 69,
          "subtopic": "Civic responsibilities",
          "content": "",
          "exercise": "5.2"
        },
        {
          "page_number": 69,
          "subtopic": "Importance of civic responsibilities to communities and a nation",
          "content": "**Importance of civic responsibilities to communities and a nation**\nFulfilment of civic responsibilities enables people in communities and nation to:\n(a) Get quality education, roads, electricity and water;\n(b) Be fully involved in social, political and economic activities for the development of the nation;\n(c) Reduce social crimes and other types of wrong doing;\n(d) Ensure that peace and security prevail in the society;\n(e) Improve the social welfare and well-being of special groups such as people with disabilities and children; and\n(f) Respect others at the family, society, national and international levels."
        },
        {
          "page_number": 69,
          "subtopic": "Categories of special groups",
          "content": "**Categories of special groups**\nSpecial groups are people with special needs and rights. Special groups comprise of the elderly, orphans, street children, refugees, people with disabilities, HIV/AIDS victims, women and children.\n\n**The elderly:** These are people who may be unable to work because of old age. They normally have old age-related health challenges and therefore need medical and"
        },
        {
          "page_number": 70,
          "subtopic": "Categories of special groups",
          "content": "social support from other people.\n\n**Orphan children:** Are those children under the age of 18 who lost one or both biological parents. We need to help orphans in case of sickness or other conditions since they have no one to take care of them.\n\n**Street children:** These are children with neither permanent residence nor family to take care of them. Street children are a result of problems such as lack of family care, family separation, the cruelty of parents or guardians and poverty. This problem is common in urban areas.\n\n**Refugees:** These are people who run away from their homeland for reasons such as wars, conflicts involving community members and natural disaster. They are homeless, frustrated and lack basic needs. Therefore, they need help to sustain their living.\n\n**People with disabilities:** These are individuals with physical, mental or psychological problems that make it difficult for them to work and live like other people. For example, some have difficulty in speaking, hearing, seeing, writing or walking. They need support to live a happy life.\n\n**HIV/AIDS victims:** These are people living with HIV/AIDS. Infection with HIV lowers their body immunity making them sick and unable to work. Therefore, they need support to meet their basic needs and live hopefully and happily.\n\n**Women and children:** These are underprivileged and isolated in many societies. Their family and community members ignore their rights and freedoms. In some families and societies, they do not have the opportunity to participate in making decisions on issues concerning their families and their lives. In some families, children are not given education. Therefore, they also need support to improve their lives."
        },
        {
          "page_number": 70,
          "subtopic": "Needs of special groups",
          "content": "**Needs of special groups**\nSpecial groups need assistance since they have challenges they may not easily cope with or solve. Some of their needs are similar, but others differ from one special group to another. The needs may be physical, psychological, social, moral or economic.\n\nThe following are needs for each special group:\n(a) The elderly require basic needs such as clothing, food, housing, love, health care and water;\n(b) Street children need education, parental care, health care, vocational training,"
        },
        {
          "page_number": 71,
          "subtopic": "Needs of special groups",
          "content": "counselling, love and protection;\n(c) People living with HIV/AIDS need health care, family and community love and counselling services. Those who are too weak to work, need support in form of basic needs like food, clothing and shelter;\n(d) Refugees need education for their children, health care, food, clothing, water and security;\n(e) People with disabilities need food, health care, clothing and shelter. Other needs are education, employment, capital and love from their families and society at large. They also need to be encouraged to consider themselves as valued people;\n(f) Women and children need to be treated fairly and with respect; they also need security and equal opportunities. Women need to be involved in leadership and decision making while children need care, education and protection; and\n(g) Orphans have basic needs such as food, shelter and clothing. They also need love, since they have missed the love of their parents.",
          "exercise": "5.3"
        },
        {
          "page_number": 72,
          "subtopic": "Needs of special groups",
          "content": "",
          "exercise": "5.4"
        },
        {
          "page_number": 72,
          "subtopic": "Responsibilities of citizens to special groups",
          "content": "**Responsibilities of citizens to special groups**\nThe following are the responsibilities of citizens towards special groups:\n(a) Supporting them by giving them material and moral assistance. This will help such groups to get basic needs such as food, shelter and clothing as well as psychological services;\n(b) Interacting with them at home and in community meetings to allow them to express their opinions and feelings;\n(c) Showing respect for and understanding to special groups. Like other people, special groups need respect for their dignity;\n(d) Providing education to all people, including those belonging to special groups. Education will help them to master their environment and to fight for their rights. For example, the education provided to refugees will help them to refrain from committing any unlawful acts or offences such as rape, banditry and illegal ownership of weapons;"
        },
        {
          "page_number": 73,
          "subtopic": "Responsibilities of citizens to special groups",
          "content": "(e) Supporting them physically when they need help, for example when children and people with disabilities such as the blind, the cripple or mentally retarded people are crossing the road; and\n(f) Providing counselling to them and socialising with them. Owing to the nature of their problems, some special groups need much socialisation and counselling. For example, people living with HIV/AIDS, orphans, street children, people with disabilities and the elderly need much socialisation and counselling."
        },
        {
          "page_number": 73,
          "subtopic": "Responsibilities of citizens to special groups",
          "content": "",
          "revision_exercise": "5"
        }
      ]
    },
    {
      "chapter_number": 6,
      "chapter_title": "Career and work-related activities",
      "introduction": "In any society, people do various activities that require mental and physical effort. These activities help them to get their basic needs. In this chapter, you will learn about the concepts of career and work and types of work-related activities. You will also learn about sources of information on career and work, procedures for choosing and developing a career, the importance of career and work to personal and national development. The competencies developed will enable you to link the subjects learnt in school with your future career and necessary skills needed to develop for a career.",
      "pages": [
        {
          "page_number": 75,
          "subtopic": "Meaning of career and related concepts",
          "content": "**Meaning of career and related concepts**\n\n**Career**\nA career is an occupation or job that someone does for a long period of his or her life. One can have a career in accountancy, medicine, geology, teaching, political science, engineering, marketing, banking, psychology, journalism, law and other fields.\n\n**Career choice**\nThis means choosing the job that one likes. For example, some people may choose careers in teaching, law, engineering, medicine, accountancy and geology. After choosing a career, one needs to further develop it.\n\n**Career development**\nCareer development means doing things which enable a person to excel in the career he or she has chosen. For example, an individual may undergo further training so as to improve knowledge and skills in relation to a career."
        },
        {
          "page_number": 75,
          "subtopic": "Factors affecting career development",
          "content": "**Factors affecting career development**\nThere are internal or external factors that can affect an individual either positively or negatively in the process of developing a career."
        },
        {
          "page_number": 76,
          "subtopic": "Factors affecting career development",
          "content": "**Internal factors that can affect career development**\nThe following are internal factors that can affect career development:\n**Personal characteristics and internal motivation:** Personal characteristics may play a significant role in choosing the occupations that one likes. For example, people who like serving others are likely to choose and enjoy working as teachers, doctors, nurses, social workers, counsellors and others. Similarly, internal force may push an individual to choose a certain career. These forces are called intrinsic motivation and may lead to interest and hobby in certain careers.\n\n**Age:** Some careers require a person of a certain age. For example, if an employee is about to retire, an employer may not give him or her an opportunity for career development. Likewise, some careers may require young people.\n\n**Health problems and disabilities:** Health problems such as chronic illness may make it difficult for some people to develop their careers; likewise a disability may have the same effect on one’s career development. However, a disability does not mean that someone is not able to perform his or her responsibilities, but it may make it difficult to develop his or her career. So, it is important to evaluate oneself before choosing a certain career.\n\n**External factors that can affect career development**\nThese are factors which are outside the individual. They include the following:\n\n**Financial resources:** Sometimes pursuing certain career options can be costly. If you choose a career that requires you to go to university or college, you may be limited by inability to pay for your studies. But if you get financial support, you can develop your career.\n\n**External motivation:** These are external forces which push an individual to develop certain careers. Extrinsic motivation refers to forces which are outside an individual, but can affect the development of a career. For example, encouragement and approval from people can affect one’s efforts to develop his or her career.\n\n**Family obligations:** Some individuals’ career development is affected by family obligations. For example, if someone has to take care of a sick elderly parent or a family member with a severe disability or health problem for a long period, it may be difficult to have adequate time and resources to develop a career."
        },
        {
          "page_number": 77,
          "subtopic": "Factors affecting career development",
          "content": "**Importance of developing a career**\nDeveloping a career is important as it:\n(a) Helps an individual to move in the right direction and achieve personal goals;\n(b) Promotes knowledge, skills and professionalism;\n(c) Strengthens motivation and confidence;\n(d) Improves efficiency and production in an organisation;\n(e) Enables organisations to reduce costs by maximising the use of individuals who get career development opportunities internally; and\n(f) Facilitates better utilisation of employees’ skills and knowledge."
        },
        {
          "page_number": 77,
          "subtopic": "Meaning of work",
          "content": "**Meaning of work**\nWork is any legal activity or task that requires mental and physical effort to achieve results. Work enables people to produce goods and services. For example, a person engaged in farming or livestock keeping is expected to use mental and physical effort to produce crops for consumption or as raw materials for industries.\nIt is the responsibility of every member of the society to explore information about what he or she wants to do, its requirements and its positive outcomes. People have to do activities which improve the quality of their lives and contribute to national development."
        },
        {
          "page_number": 77,
          "subtopic": "Types of work-related activities",
          "content": "**Types of work-related activities**\nWork-related activities may be categorised as physical and mental work-related activities.\n**Physical work-related activities:** These are activities which need more of physical energy than mental energy. Examples include cultivation, plumbing and carpentry.\n**Mental or intellectual work-related activities:** These are duties and tasks which require mental effort to accomplish. Duties such as teaching, designing and communication networking require mental effort."
        },
        {
          "page_number": 78,
          "subtopic": "Types of work-related activities",
          "content": "The following is a classification of careers and fields in which people may find various jobs:\n**Agriculture, food and resource production:** In this field, people work as farmers and livestock keepers, engage in crops, energy or oil production and the distribution of commodities such as wood and animal products.\n**Architecture and construction:** People do activities related to designing, engineering, physical labour, planning, management and drafting. In designing things, people may engage in architecture, structural engineering and infrastructure designing.\n**Finance:** In this field, people work as financial analysts, bank managers and staff, accountants, auditors, salesmen, investment bankers, investment analysts, financial planners, insurance brokers and the like.\n**Transport, distribution and logistics:** People may be interested in working in such fields as airlines, shipping, road or railway transportation.\n**Manufacturing:** In the manufacturing field, people may be employed as line workers, labourers, operation managers, quality professionals, design engineers, systems analysts, supply chain specialists and machine maintenance personnel.\n**Health science:** In this field, people may work as doctors, nurses, medical scientists, disease management professionals and others.\n**Human services:** People working in this area include social workers, counsellors, psychologists, caseworkers, the state and city officials involved in public planning projects, teachers and those working in the non-profit sectors.\n**Marketing, sales and services:** People working in marketing includes designers, account executives, salesmen, and others. The sales sub-sector includes business development managers, sales managers and customer service personnel.\n**Hospitality and tourism:** In this field, people work as waiters and waitresses, hotel and restaurant managers, tour guides, travel guides, resort workers and operational staff in any type of leisure or travel-related industry.\n**Law, public safety and security:** In the legal profession, people work as lawyers, legal advisors, advocates, judges, court officials and others.\n**Science, engineering and information technology:** The careers in such sectors include people working as natural scientists, physicists, data scientists, biotechnologists and others.\n**Education and training:** This includes teachers, education administrators, physical education trainers, lecturers, tutors, mentors, special needs professionals and"
        },
        {
          "page_number": 79,
          "subtopic": "Types of work-related activities",
          "content": "academic advisors.\n**Arts, journalism and mass communication:** It involves people working as actors, musicians, singers, photographers, news analysts and reporters, graphic designers, authors and editors.",
          "exercise": "6.1"
        },
        {
          "page_number": 79,
          "subtopic": "Choosing a career",
          "content": "**Choosing a career**\nChoosing a career is a continuous process. Success in any kind of career is the result of your effort to learn and make good decisions. There are different procedures that you can follow when choosing a career. These procedures are as follows:\n\n**Assess yourself (knowing yourself):** Each person has different goals, values, interests and talents. Think about where you are now, where you want to be in the future and how you will get there. Making self-assessment promotes the making of proper decisions in choosing a satisfying career.\n\n**List careers of your interest:** Find information on different careers and work-related"
        },
        {
          "page_number": 80,
          "subtopic": "Choosing a career",
          "content": "activities in your community. In addition, read newspapers, books and magazines, watch television programmes and visit social media networks to find new career opportunities.\n\n**Identify options:** Find detailed information about procedures, conditions and other important requirements for each career. For example, if you want to be an engineer find out what skills, education and values an engineer needs to have.\n\n**Narrow down your list of careers and work-related activities:** Choose the best career after assessing all the options. Make sure that the career matches your interests, values, strengths and talents.\n\n**Be focused:** Do not get distracted by other people’s opinions as long as the choice suits your values, strengths and talents. Focusing on the career of your choice increases chances of achieving your dreams."
        },
        {
          "page_number": 80,
          "subtopic": "Sources of information on careers",
          "content": "**Sources of information on careers**\nAccess to information pertaining to a range of careers is necessary for career choice. The following are some of the sources of information on careers:\n**Parents and guardians:** These people can expose you to information about certain careers. Parents can give you information about procedures, conditions and requirements pertaining to a given career.\n\n**Peers or friends:** These are important people who may give you information about social, academic and economic matters. Normally, our friends and peers play a vital role in influencing us to choose a particular career.\n\n**Mass media:** The information we receive from television, radio, newspapers, magazines and journals may inform us about different careers.\n\n**Internet:** Browsing the Internet and social networks such as WhatsApp, Facebook, Twitter and Instagram may expose you to careers that match your interests.\n\n**Occupational visits:** With the help of the school counsellor or subject teacher, students can visit certain organisations, institutions, companies or factories to learn about work-related activities. Through such visits, you become aware of the various procedures, conditions and requirements necessary to particular careers and work-related activities.\n\n**Visiting libraries and career information centres:** You may visit libraries or career information centres and look at the catalogue labelled “vocations” or “careers” to find a career with animals, for example, you may find related descriptions by veterinarians, zoologists, animal trainers, breeders, groomers and individuals who work with animals."
        },
        {
          "page_number": 81,
          "subtopic": "Sources of information on careers",
          "content": "**Inviting guest speakers:** People working in different organisations, companies, institutions and government offices can be invited to talk to students about their careers and the work experience. If that is done, students can be exposed to different careers or jobs. For example, a medical doctor could be invited to a school to talk to students about various job opportunities in the health sector.",
          "exercise": "6.2"
        },
        {
          "page_number": 81,
          "subtopic": "Importance of work to personal and national development",
          "content": "**Importance of work to personal and national development**\nEveryone in society wishes to have a career or job that meets their personal interests, goals, values and talents. The development of an individual and a nation can be achieved if everybody works hard and smart to produce goods and provide services that promote the well-being of all people in the society.\n\n**Importance of work to an individual**\n(a) **Satisfaction of human needs:** Work enables people to satisfy basic needs such as food, clothing and shelter. For example, farmers produce crops for sale to get money for other needs. Doctors, bank managers, teachers, social workers, engineers or lawyers are paid salaries to carter for their needs.\n(b) **It builds social identity:** People are identified on the basis of what they do. For instance, one can be identified as a teacher, lawyer, peasant, pastoralist, engineer or doctor.\n(c) **It promotes culture:** The traditions and values of certain people relate to their"
        },
        {
          "page_number": 82,
          "subtopic": "Importance of work to personal and national development",
          "content": "daily activities. For example, in Tanzania the Maasai and Sukuma are known as livestock keepers and the Makonde as carvers.\n(d) **It promotes personal worth, dignity and respect:** People who are committed to work and produce high quality services and goods earn respect and are valued in the society.\n(e) **It promotes peace and security:** If everyone in the community works, the number of unemployed decreases, and thus social crimes such as drug abuse, prostitution and theft are reduced.\n(f) **It helps to maintain one’s health:** A person who does work that requires mental or physical effort develops a sense of psychological satisfaction and his or her mind becomes active.\n\n**Importance of work to national development**\n(a) **Work is a source of government revenue or income:** It is through work that people earn money to pay tax to the government.\n(b) **It enables a government to provide social services:** Work enables people to earn money to pay for social services such as water, education, electricity and medical care. People in the public sector working as teachers, doctors and engineers work on behalf of the government in the provision of social services.\n(c) **The income obtained from work enables a nation to be economically independent and free from external control.** People who produce their own goods and services minimize dependency and external control of their economy.\n(d) **It reduces crime and other social problems such as robbery, theft and plundering.**\n(e) **People who work in agricultural and industrial production, produce goods and services.** These are sometimes exported and help the government to earn foreign exchange."
        },
        {
          "page_number": 83,
          "subtopic": "Importance of work to personal and national development",
          "content": "",
          "exercise": "6.3"
        },
        {
          "page_number": 83,
          "subtopic": "Importance of work to personal and national development",
          "content": "",
          "revision_exercise": "6"
        }
      ]
    },
    {
      "chapter_number": 7,
      "chapter_title": "Family life education",
      "introduction": "A family is one of the most important social institutions which promotes the well-being of a person. In this chapter, you will learn about the concept of family, types of families and the importance of a family. You will also learn ways of building healthy relationships among family members as well as rights and responsibilities of each family member. Furthermore, you will learn about the effects of not carrying out family responsibilities. The competencies developed will help you to play your part as a family member in building a peaceful and responsible family.",
      "pages": [
        {
          "page_number": 85,
          "subtopic": "Concept of family",
          "content": "**Concept of family**\nA family is a group of people who are related by blood, marriage or adoption. While it is true that families begin with a father and a mother, not all families have both parents. Some families have a single parent. In that case, children live with either a father or a mother. In other cases, two adults, a man and a woman, who are married and live together, may not have children for biological reasons. However, they may still be identified as a family."
        },
        {
          "page_number": 86,
          "subtopic": "Concept of family",
          "content": "",
          "exercise": "7.1"
        },
        {
          "page_number": 86,
          "subtopic": "Types of families",
          "content": "**Types of families**\nThe following are common types of families: a nuclear family, an extended family, a single-parent family and a couple family. These types are described below:\n\n**A nuclear family:** This type of family consists of a wife, a husband and children. It is predominant in Western societies.\n\n**An extended family:** This is a family which consists of a wife, a husband, children and other relatives. Children and other relatives like cousins, grandmothers and grandfathers are also part of the family. It is predominant in most of the developing countries such as African countries.\n\n**A single-parent family:** This type of family consists of one parent and a child or children. It may be a father or a mother and his or her child or children. This situation may be caused by death, divorce, family conflicts or personal choice.\n\n**A couple family:** This family consists of only a wife and a husband. In this type of family, the two live together for a certain period of time before they have a child or children."
        },
        {
          "page_number": 86,
          "subtopic": "Importance of a family",
          "content": "**Importance of a family**\nAs a basic unit of society, a family is important to both its members and the society. The importance of a family is explained below.\n\n**A family contributes to the development of children’s personalities:** Before children go to school, it is the family that teaches them values, beliefs, habits and social skills."
        },
        {
          "page_number": 87,
          "subtopic": "Importance of a family",
          "content": "These aspects determine how they behave as they grow up. A family with close relationship promotes good manners, discipline and morals among the children.\n\n**A family is the foundation of trust:** Individuals learn to have confidence in themselves as well as in other people through what their families do. Although one may have friends, neighbours and classmates, loyalty is found in one’s family.\n\n**A family strengthens a society:** A good family is an example to a whole society. The father, mother and children have to work together to build a family. Families provide children with opportunities to work so that in future they can be productive and responsible citizens. It is in a family where children are moulded into good citizens.\n\n**A family develops good morals:** A family is a good foundation for developing good morals and ethical conduct. It is through the family that the society’s moral standards, ethical conduct, integrity and fidelity are developed.\n\n**A family fosters cooperation in a society:** Individuals learn how to cooperate in their families. Families which encourage children to work together, help to build a cooperative society. A cooperative family enables its members to work together to achieve their goals and fosters national development.\n\n**A family socialises and inculcates values of a society in its children:** In the family, children learn the traditions and customs of their society. For example, they are encouraged to work hard, obey rules and regulations to become valuable and acceptable members of the society.\n\n**A family promotes peace and security:** Each family member has to ensure that the whole family is safe and well protected from harm such as physical hurt, abuse and harassment.\n\n**A family promotes economic development:** Individual and national development are the result of family effort to encourage each member to work hard and to participate in production activities such as agriculture and entrepreneurship."
        },
        {
          "page_number": 87,
          "subtopic": "Factors contributing to family stability",
          "content": "**Factors contributing to family stability**\nThe stability of a family is a result of the strength of the bond among family members. A strong family is usually characterised by members loving, caring, respecting and communicating to each other to achieve common goals."
        },
        {
          "page_number": 88,
          "subtopic": "Factors contributing to family stability",
          "content": "The following are factors contributing to the stability of the family:\n\n**Showing love and a sense of belonging:** A stable family has members who respect, care about and love each other. They take care of each other so as to maintain their blood relationship and the stability of the family."
        },
        {
          "page_number": 89,
          "subtopic": "Factors contributing to family stability",
          "content": "**Spending time together:** Family members work together to develop a sense of belonging and respect the contribution that everyone makes to the family. Parents, children and other relatives discuss issues and work for the interests of the whole family.\n\n**Communicating openly:** Family members communicate and share their feelings, emotions and ideas without fear of judgment or criticism. Each member listens to and understands the concerns of others. Children are free to ask and express their opinions about academic issues, relationships and health matters to their parents or other relatives without any restrictions.\n\n**Following religious teachings:** Religious teachings promote a spiritual life. By following religious teachings and practices, family members develop the inner strength they need to cope with difficulties. This holds them together as one unit.\n\n**Coping with stress positively:** In a stable family, each family member is aware that a family may have good and bad times. Each family member learns how to support and encourage one another during difficulties.\n\n**Having a positive attitude:** A stable family focuses on positive aspects and does not allow negativity to prevent its members from achieving their goals. Family members need to encourage one another, share ideas and ways of achieving the objectives of each member and of the family as a whole.\n\n**Encouraging each other:** Each family member recognises and appreciates the efforts and contribution of others. For example, parents appreciate their children when they are struggling to do well in their studies and in other activities. Children also appreciate their parents’ efforts to improve their standard of living.\n\n**Fulfilling responsibilities:** Each family member, including children, fulfils his or her responsibilities for the welfare of the whole family.\n\n**Having a sense of humour, trust and respect:** Family members respect each other, play and laugh together, trust one another and discuss personal and family issues openly. Children who are trustworthy and respectful become happy and confident in their lives because they are loved and cared for, not only by their parents, but also by the society as a whole.",
          "exercise": "7.2"
        },
        {
          "page_number": 90,
          "subtopic": "Factors contributing to family stability",
          "content": ""
        },
        {
          "page_number": 90,
          "subtopic": "Importance of family stability and healthy relationships",
          "content": "**Importance of a healthy family relationship**\nThe importance of a healthy family relationship can be described at three levels: family, community and national levels.\n\n**At family level**\n(a) A family acts as a basic unit of labour in society, where the family members participate in social and economic activities for sustainability;\n(b) Stable families contribute to the building of high self-esteem among family members;\n(c) Stable families help family members to have a good habit and engage in legal activities; and\n(d) Children who belong to stable families are likely to establish their own families in the future, thereby ensuring continuity of the family as a unit.\n\n**At community level**\n(a) A family promotes individual development;\n(b) Families enhance respect and love among community members;"
        },
        {
          "page_number": 91,
          "subtopic": "Importance of family stability and healthy relationships",
          "content": "(c) Family relationships help to create a spirit of unity and solidarity among community members;\n(d) Family relationships enhance cooperation and integration in a community; and\n(e) Stable families help to reduce the number of street children.\n\n**At national level**\n(a) Family relationships are a source of national solidarity and unity;\n(b) Children raised in a stable family are less likely to engage in criminal acts, and as a result, they reduce crime;\n(c) Stable families encourage members of their families to contribute to national development;\n(d) Stable families reduce economic, technological, social and political dependence;\n(e) Stable and healthy families make it possible to get competent leaders;\n(f) Stable families lay a foundation for the nation to get competent experts in various sectors; and\n(g) Families help to increase the development of science and technology because people effectively engage in development activities."
        },
        {
          "page_number": 91,
          "subtopic": "Responsibilities of family members",
          "content": "**Responsibilities of family members**\nA family’s responsibility means a duty, obligation or role that a family member has to perform. In the past, a father was assumed to be the bread winner, the head of the family and the decision-maker. It was assumed that he had many responsibilities and the mother was assumed to be responsible for taking care of the family. Nowadays, both the mother and the father may have the same responsibilities in a family."
        },
        {
          "page_number": 92,
          "subtopic": "Responsibilities of family members",
          "content": "",
          "exercise": "7.3"
        },
        {
          "page_number": 92,
          "subtopic": "Children’s responsibilities",
          "content": "**Children’s responsibilities**\nChildren have the following responsibilities in a family:\n(a) Helping their parents to perform domestic chores such as mopping, washing dishes, slashing grass, feeding domestic animals and gardening;\n(b) Taking care of their younger siblings;\n(c) Respecting and obeying parents and elders; and\n(d) Engaging in learning and attending school."
        },
        {
          "page_number": 92,
          "subtopic": "Parents’ responsibilities",
          "content": "**Parents’ responsibilities**\nThe responsibilities of parents in a family include the following:\n(a) Maintaining family discipline and peace;\n(b) Orienting children to customs and traditions of the society;\n(c) Providing basic needs to family members such as food, clothing and shelter;\n(d) Organising family activities, advising and guiding their children so that they develop proper behaviour; and\n(e) Providing security and making decisions for the benefit of the whole family."
        },
        {
          "page_number": 92,
          "subtopic": "Consequences of not fulfilling family responsibilities",
          "content": "**Consequences of not fulfilling family responsibilities**\nNot fulfilling family responsibilities may have the following consequences to various people:\n(a) Children and other dependants may lack basic needs such as food, shelter and clothes if parents do not fulfil their responsibilities;\n(b) Parents may not do important tasks for the benefit of their children if the children do not fulfil their responsibilities;"
        },
        {
          "page_number": 93,
          "subtopic": "Consequences of not fulfilling family responsibilities",
          "content": "(c) A family may become unstable, and as a result, children may develop improper behaviour;\n(d) Conflicts may result from frequent misunderstandings among family members;\n(e) If parents do not fulfil their obligations, children may not get education; and\n(f) If children do not fulfil their responsibilities, they may make their parents unhappy and therefore, they may fail to achieve the expected results in the tasks assigned to them."
        },
        {
          "page_number": 93,
          "subtopic": "Consequences of not fulfilling family responsibilities",
          "content": "",
          "revision_exercise": "7"
        }
      ]
    },
    {
      "chapter_number": 8,
      "chapter_title": "Proper behaviour and decision making",
      "introduction": "In chapter three, you learnt about effective decision-making as an important skill to personal life. In this chapter, you will learn about the concept of proper behaviour, types of behaviour, indicators and the importance of behaving well. You will also learn the consequences of not behaving well and the ways to get rid of improper behaviour. Furthermore, you will learn about the concept of rational decision making and how to make rational decisions. The competencies developed will enable you to make rational decisions for your personal development and become a role model to others.",
      "pages": [
        {
          "page_number": 94,
          "subtopic": "Meaning of behaviour",
          "content": "**Meaning of behaviour**\nAt some point in life, people are affected by the way they behave. Their behaviour may have certain effects on themselves and others. The word behaviour refers to actions or conducts demonstrated by an individual in response to internal or external stimuli. One’s behaviour is reflected in the way one dresses, talks, eats, and interacts with others in different situations."
        },
        {
          "page_number": 94,
          "subtopic": "Types of behaviour",
          "content": "**Types of behaviour**\nSince human behaviour can be observed and measured by other people, it can be classified as proper or improper. Proper behaviour refers to acts or manners which are considered positive and acceptable in a society. Such acts include being honest, working hard, loving others, being kind, obedient and empathetic as well as co-operating with others. Improper behaviour refers to acts or manners which are considered negative and not acceptable in a society. Some of such acts include drug abuse, prostitution, corruption, theft, selfishness, robbery, truancy, alcoholism and laziness."
        },
        {
          "page_number": 95,
          "subtopic": "Types of behaviour",
          "content": "",
          "exercise": "8.1"
        },
        {
          "page_number": 95,
          "subtopic": "Factors influencing our behaviour",
          "content": "**Factors influencing our behaviour**\nLife is like a journey. It begins at conception and ends at death. As we grow up, we pass through different stages of development accompanied by different changes reflecting maturity. A change in behaviour occurs during this journey and can be influenced by the factors listed below.\n\n**Genetic inheritance:** Human beings inherit essential features from their fore-parents. These features may affect how individuals behave. For example, some students may find it difficult to make friends while others make friends easily. Also, some students are hot tempered while others are not.\n\n**Parental care:** Parents who are loving, hardworking, cooperative and caring may influence their children to have proper behaviour. Those who are lazy, restrictive, careless and drunk, are likely to influence their children to adopt improper behaviour.\n\n**Peer groups:** We tend to imitate and comply with the behaviour of our friends at home, school or anywhere else. Sometimes owing to peer pressure, we follow their actions without assessing their strengths and weaknesses."
        },
        {
          "page_number": 96,
          "subtopic": "Factors influencing our behaviour",
          "content": "**Development in science and technology:** The use of television, radio, newspapers, smart phones, ipads, tablets and computers has led people to have good or bad behaviour. Access to information through social media networks such as Twitter, Facebook, WhatsApp and Instagram influences the behaviour of users.\n\n**Ignorance:** Some people behave improperly because of ignorance. Education enables people to learn how to behave properly.\n\n**Religious teachings:** Religious teachings influence people to have proper behaviour. People are taught to love each other, be tolerant, to endure hardship, to be faithful, and to forgive and be kind.\n\n**Economic status:** Economic hardship is likely to prompt people to engage in illegal acts such as drug abuse, theft, corruption, prostitution and terrorism because of their economic status. However, some rich people may use their economic power to abuse other people’s rights."
        },
        {
          "page_number": 96,
          "subtopic": "Elements or indicators of proper and improper behaviours",
          "content": "**Elements or indicators of proper and improper behaviours**\nAs we live and interact with parents, peers, teachers and other people in our society, we become aware of their proper or improper behaviour. We need to imitate and adopt good behaviour because it promotes our personal well-being and that of our society.\n\nExamine the following behaviours and then do the activity that follows:\n(a) Helping parents with domestic chores;\n(b) Taking someone else’s property without consent;\n(c) Being aggressive and fighting with others;\n(d) Taking care of disabled people;\n(e) Isolating your fellow students because of their poor performance;\n(f) Working hard while doing school and home activities;\n(g) Alcoholism and taking illegal drugs;\n(h) Being silent about mistreatment or abuse;\n(i) Disclosing secrets of parents about their abusive behaviour;\n(j) Taking drugs which have not been prescribed by a doctor; and\n(k) Being patriotic to your country."
        },
        {
          "page_number": 97,
          "subtopic": "Elements or indicators of proper and improper behaviours",
          "content": ""
        },
        {
          "page_number": 97,
          "subtopic": "Importance of behaving properly",
          "content": "**Importance of behaving properly**\nThe following is the importance of proper behaviour:\n(a) Reduces crime and brings about peace, harmony, unity and cooperation in the society;\n(b) Develops a sense of love, respect and solidarity among society members;\n(c) Promotes a hardworking culture among society members and contributes to development and prosperity;\n(d) Ensures people have the freedom to fulfil their duties and responsibilities;\n(e) Encourages people to practise good hygiene, which in turn, protects them from diseases and other harmful organisms;\n(f) Promotes tolerance and happiness among people in the society;\n(g) Makes people patriotic to their countries and avoid foreign culture which can distort their cultural values; and\n(h) Promotes integrity, solidarity and friendship within families, communities and the nation."
        },
        {
          "page_number": 97,
          "subtopic": "Consequences of improper behaviour",
          "content": "**Consequences of improper behaviour**\nImproper behaviour has negative effects to an individual and the society. The following are some of the consequences of improper behaviour to a society:\n\n**Increasing social crime:** People who behave improperly are likely to engage in illegal activities which may endanger their lives or lives of others. For example, theft, robbery, terrorist acts and drug abuse are common crimes committed by people with improper behaviour.\n\n**Slowing down economic development:** Improper behaviour such as laziness, theft and drunkenness slows down personal and national development. People who behave improperly usually are not likely to engage effectively in economic activities.\n\n**Causing health problems:** Improper behaviour such as alcoholism, drug abuse, prostitution and poor personal hygiene may harm individuals health."
        },
        {
          "page_number": 98,
          "subtopic": "Consequences of improper behaviour",
          "content": "**Increasing discriminatory acts:** Individuals with improper behaviour are perceived to be dangerous to the well-being of the family and society. As a result, people with improper behaviour are isolated in the society.\n\n**Causing low efficiency and performance:** Improper behaviour decreases personal efficiency. People who are lazy, harsh and angry may not be efficient in their work.\n\n**Causing deaths:** People who behave improperly may die early due to their engagement in risky behaviour such as drug abuse, theft, prostitution, alcoholism and other similar behaviours."
        },
        {
          "page_number": 98,
          "subtopic": "Avoiding improper behaviour",
          "content": "**Avoiding improper behaviour**\nThe wish of any society is to see its members behave properly. A society with members who behave properly is peaceful. As a member of our society, it is expected that you will behave properly. The following acts will help you avoid improper behaviour:\n(a) Starting healthy friendship with peers whom you trust, respect and who care about you. This will help you to learn good behaviour from them and receive advice when you face challenges that can negatively change or trigger your emotions;\n(b) Parents and other people are the first teachers who teach us good values. The rules and values governing our society enable us to learn and practise good acts that promote our morality;\n(c) Being hardworking enables people to live happily. Working hard reduces dependence, theft and corruption;\n(d) Following religious teachings positively impacts our lives by promoting our spiritual well-being and inculcating good manners;\n(e) Seeking guidance and counselling services when you are facing challenges and problems which are beyond your control is encouraged. One should find alternative ways of solving or coping with difficulties; and\n(f) Self-discipline will help you choose information which is appropriate and which exposes you to positive thinking so as to develop necessary knowledge and skills."
        },
        {
          "page_number": 99,
          "subtopic": "Avoiding improper behaviour",
          "content": "",
          "exercise": "8.2"
        },
        {
          "page_number": 99,
          "subtopic": "Rational decision-making",
          "content": "**Rational decision-making**\nRational decisions are choices which an individual makes after thinking carefully about the available options for solving a particular problem. This includes logical reasoning, which is a process of choosing the best option from available options. Rational decision-making is the process of choosing the best choices in life. It involves making logical choices aimed at achieving one’s goals."
        },
        {
          "page_number": 99,
          "subtopic": "Rational decision-making steps",
          "content": "**Rational decision-making steps**\nMaking rational decisions requires one to follow the following steps:\n(a) **Identify the problem:** You need a clear definition of the issue at hand or the problem that you want to solve.\n(b) **Gather relevant information:** Make sure that you collect relevant information about what you want to do. The information can be obtained through reading books, newspapers, listening to news, doing research and talking to other people in the society.\n(c) **Develop alternatives:** As you collect information, you will find possible causes of the problem. List all desirable alternatives that you think will help you solve the problem.\n(d) **Evaluate the alternatives:** Try to assess the strengths and weaknesses of each alternative then choose the one which will help you to solve the problem."
        },
        {
          "page_number": 100,
          "subtopic": "Rational decision-making steps",
          "content": "(e) **Take action:** After choosing the best alternative, take action to implement the strategy you have chosen.\n(f) **Review the decision you have made:** Evaluate the outcome of your decision. If the decision has not helped you to address the problem, you may be required to make a new decision after collecting more information about it."
        },
        {
          "page_number": 100,
          "subtopic": "Skills for making rational decisions",
          "content": "**Skills for making rational decisions**\nRational decision-making requires the following skills:\n\n**Active listening skills:** Active listening involves paying attention to what a person is saying or concentrating on one’s own feelings. It helps an individual to make rational decisions consciously after understanding the message from either internal or external environment.\n\n**Time management skills:** When making decisions, one has to manage time. Poor allocation of time will result in making irrational decisions, which may lead to making more mistakes. People need to be calm and avoid pressure that may lead them to make irrational decisions. Being well-organised and having good plans may reduce the stress and worries associated with the pressure to make irrational decisions.\n\n**Sharing skills:** Sometimes you need to involve others in making decisions in order to achieve personal or group goals. Making decisions may be difficult without involving other people who might provide more insights into the issue or problem at hand. Again, making a decision that involves two parties requires effective communication and collaboration of the parties concerned.\n\n**Critical thinking skills:** Critical thinking involves an individual’s ability to analyse and evaluate ideas in a sensible manner. This implies expressing opinions and making rational choices. In addition, critical thinking involves independent thinking which helps us to make rational decisions after assessing possible alternatives. Before making any decision, you need to think critically about all the possible ways of solving the problem.\n\n**Creative thinking skills:** Creative thinking refers to the application of new ideas and ways of doing something or solving a problem. It involves making observations, analyses, drawing inferences and developing effective communication. Under normal circumstances, creative thinking helps an individual to come up with proper solutions to problems.\n\n**Problem-solving skills:** Problem-solving is the ability to come up with effective"
        },
        {
          "page_number": 101,
          "subtopic": "Skills for making rational decisions",
          "content": "solutions to various challenges or problems. The problems can be financial, hardships, family conflicts, health problems or academic problems. One has to identify the nature of the problems by analysing the causes and coming up with possible solutions. This process enables one to choose the best alternatives."
        },
        {
          "page_number": 101,
          "subtopic": "Steps of problem-solving",
          "content": "**Steps of problem-solving**\nThe following are steps in problem-solving:\n(a) **Identify the problem:** The problem being referred to here is that which one clearly knows about.\n(b) **Understand other people’s interests:** Share your interests with others before adopting a given solution. Listen to them carefully and reconcile your differences so as to learn and understand other people’s interests.\n(c) **Develop some options:** Ask trustworthy people, read relevant books and consult other sources such as the Internet for alternative solutions to the problem.\n(d) **Evaluate the options:** Look at the strengths and weaknesses of each option and prioritise the options.\n(e) **Select the best option:** Usually the best option is the one which matches your abilities and resources.\n(f) **Implement the selected option and assess its success:** At this stage, implement the selected option and make assessment of each stage of the implementation."
        },
        {
          "page_number": 101,
          "subtopic": "Importance of making rational decisions",
          "content": "**Importance of making rational decisions**\nThe following is the importance of making rational decisions:\n(a) Rational decision-making helps to build a sense of commitment and cooperation among society members who are making decisions;\n(b) It facilitates proper utilisation of resources and helps people to make a collective effort in making decisions on matters concerning the society;\n(c) It promotes democracy, since almost everyone participates in decision making;\n(d) It promotes peace and harmony because it helps to prevent conflicts that could happen as a result of making irrational decisions;"
        },
        {
          "page_number": 102,
          "subtopic": "Importance of making rational decisions",
          "content": "(e) It promotes personal development as it enables one to solve problems using alternative ways which produce positive outcomes;\n(f) It helps to develop confidence and happiness. People who make rational decisions are always happy and confident; and\n(g) It reduces the number of mistakes which might lead to more problems. For example, a student’s decision to abstain from alcohol and drugs improves one’s health.",
          "exercise": "8.3"
        },
        {
          "page_number": 102,
          "subtopic": "Ways of avoiding making irrational decisions",
          "content": "**Ways of avoiding making irrational decisions**\nThe following are ways of avoiding making irrational decisions:\n(a) **Seek relevant information:** Our decisions are sometimes influenced by information that we receive from other people. However, avoid taking any action based on hearsay; rather, seek adequate information about the issue before making any decision.\n(b) **Avoid making common mistakes:** That may affect your ability to make rational decisions. Such mistakes may include not having enough time or information and paying little attention to reflect on a particular issue.\n(c) **Learn from previous mistakes:** In order to make rational decisions, one needs to look at past mistakes and find new strategies for solving the problem at hand."
        },
        {
          "page_number": 103,
          "subtopic": "Ways of avoiding making irrational decisions",
          "content": "(d) **Do self-assessment:** Be confident and stable, and do not allow emotions and feelings to influence your decisions.\n(e) **Observe time:** Do not make decisions when you are tired or when you are not feeling well. Take a rest and refresh your mind. As you take a rest, think critically about the issue.\n(f) **Predict the outcomes:** Foresee the possible outcome of any decision you want to make. Analyse the strengths and weaknesses of each alternative in order to choose the right one."
        },
        {
          "page_number": 103,
          "subtopic": "Ways of avoiding making irrational decisions",
          "content": "",
          "revision_exercise": "8"
        }
      ]
    },
    {
      "chapter_number": 9,
      "chapter_title": "Road safety education",
      "introduction": "Road safety education has been part and parcel of our life. It helps us to understand various road signs. In this chapter, you will learn how to interpret road signs, the importance of road signs and the magnitude and causes of road accidents. You will also learn measures to prevent road accidents. The competencies developed will help you to be careful when you are using roads and provide road safety education to others.",
      "pages": [
        {
          "page_number": 105,
          "subtopic": "Meaning of road safety education",
          "content": "**Meaning of road safety education**\nRoad safety education refers to knowledge, skills and values provided to people to enable them use roads safely. It develops good behaviour and enhances the safety of road users."
        },
        {
          "page_number": 105,
          "subtopic": "Road signs",
          "content": "**Road signs**\n[FIGURE 9.1: Sample of road signs]"
        },
        {
          "page_number": 106,
          "subtopic": "Road signs",
          "content": "Road signs are symbols and signs designed to provide instructions and information to direct and guide road users on proper use of roads. They are placed or posted on poles or on each side of the road, overhead structures or painted on the road surface."
        },
        {
          "page_number": 106,
          "subtopic": "Interpretation of road signs",
          "content": "**Interpretation of road signs**\nRoad signs can be categorised into three groups: command or order signs, precaution or warning signs and regulatory or informative signs.\n\n**Command or order signs:** These signs are prepared to control the actions of road users, especially the speed of motor vehicles. They are also used to control the movement of people. Command or order signs are of two types: permit signs and limit or prohibit signs.\n\n**Permit signs** are command signs which allow road users to cross the road. These signs are indicated using a blue colour, as shown in Figure 9.2."
        },
        {
          "page_number": 107,
          "subtopic": "Interpretation of road signs",
          "content": "[FIGURE 9.2: Sample of permit signs]\n\n**Limit or prohibit signs** are command or order signs which prohibit motor vehicles or road users to use the road. These signs are enclosed within a red circle as shown in Figure 9.3.\n\n[FIGURE 9.3: Sample of prohibit (command) or order signs]\n\n**Precaution or warning signs:** These signs are prepared to alert or warn road users that they need to pay special attention to accidents which may happen while they are using the road. Warning signs are shown within a triangle with thick red borders as shown in Figure 9.4."
        },
        {
          "page_number": 108,
          "subtopic": "Interpretation of road signs",
          "content": "[FIGURE 9.4: Sample of warning signs]\n\n**Informative or regulatory signs:** These road signs are meant to give instructions to road users. The signs indicate or reinforce traffic laws, regulations or requirements which apply either all the time or at specific times, as shown in Figure 9.5."
        },
        {
          "page_number": 109,
          "subtopic": "Interpretation of road signs",
          "content": "[FIGURE 9.5: Sample of informative or regulatory signs]\n\nMoreover, road signs can also be interpreted on the basis of their shape, colour and texts.\n\n**Shape:** The shape of a sign is one of the ways through which one can interpret the sign. Some of the signs on our roads have a unique shape. Such signs are also referred to as regulatory signs. These shapes are elaborated below.\n\n(a) **Octagon** – the octagon shape is unique, it is a stop sign.\n[FIGURE 9.6: Stop road sign]"
        },
        {
          "page_number": 110,
          "subtopic": "Interpretation of road signs",
          "content": "(b) **Pentagon** – the pentagon or house shape sign with children, represents a school zone.\n[FIGURE 9.7: School zone road sign]\n\n(c) **Cross** – the big X is called a cross buck and is used to indicate railway crossings.\n[FIGURE 9.8: Railway crossing road sign]\n\n**Colour:** The background colour of road signs is intentional. Different colours represent different types of content. The colours used on road signs include those of traffic lights which are red, green and yellow (amber).\n\n**The red light:** It is used to limit the movement of motor vehicles. In other words, it orders road users, especially drivers, to stop.\n\n**The yellow (amber) light:** This tells drivers to get prepared to stop, or to go.\n\n**The green light:** This tells drivers to proceed with their journey.\n[FIGURE 9.9: Traffic lights]"
        },
        {
          "page_number": 111,
          "subtopic": "Interpretation of road signs",
          "content": "Other background colours painted on road signs are white, yellow, red and green.\n(a) **White:** This colour is painted on regulatory signs.\n[FIGURE 9.10: Road sign with a white background]\n\n(b) **Yellow (amber):** This colour is painted on warning signs.\n[FIGURE 9.11: Road sign with a yellow (amber) background]"
        },
        {
          "page_number": 112,
          "subtopic": "Interpretation of road signs",
          "content": "(c) **Red:** This colour is painted on the signs that alert road users of a danger.\n[FIGURE 9.12: Road signs with a red background]\n\n(d) **Green:** This colour is painted on informative road signs.\n[FIGURE 9.13: Road sign with a green background]\n\n**Texts:** In addition to the shape and colour of road signs, the text printed on road signs informs road users what to do, through written words as shown in Figure 9.14.\n\n[FIGURE 9.14: Road sign with a text]"
        },
        {
          "page_number": 113,
          "subtopic": "Importance of obeying road signs",
          "content": "**Importance of obeying road signs**\nIt is important for all road users to obey road signs. Road signs help to prevent accidents which may happen if one does not obey them. The following is the importance of obeying road signs:\n(a) Road signs help to reduce road accidents by limiting the speed of motor vehicles;\n(b) They assist in developing a sense of discipline among road users and thus help to prevent road accidents;\n(c) They provide an equal chance and access to all road users;\n(d) They improve and sustain the decision-making skills of road users, especially those relating to how one should act during an emergency. This helps to ensure the security of all road users and to reduce the number of accidents; and\n(e) Road signs are used in place of traffic police officers."
        },
        {
          "page_number": 113,
          "subtopic": "Consequences of not obeying road signs",
          "content": "**Consequences of not obeying road signs**\nFailure to obey road signs may have the following consequences:\n(a) It may cause injuries to people, permanent physical disabilities leading to an economic decline due to loss of a productive workforce;\n(b) It damages roads, motor vehicles and other types of infrastructure like houses and bridges. This may lead to economic losses, since roads are constructed using government funds;\n(c) It may cause grief due to death of parents, children and other relatives;\n(d) It may lead to wastage of time among road users if an accident occurs and leads to closure of the road; and\n(e) It increases unnecessary expenditure on the part of the government and individuals because more funds will be spent on treating the victims of road accidents, rebuilding damaged infrastructure as well as maintaining damaged motor vehicles or buying new ones."
        },
        {
          "page_number": 114,
          "subtopic": "Consequences of not obeying road signs",
          "content": "",
          "exercise": "9.1"
        },
        {
          "page_number": 114,
          "subtopic": "Causes of road accidents",
          "content": "**Causes of road accidents**\nA road accident is an unfortunate, unexpected and unintentional incident that happens on the road. It usually results in the damage of motor vehicles, injuries or death of pedestrians, animals or people carried in vehicles. Most road accidents occur as a result of careless driving, drivers’ weakness and lack of patience. Accidents may also occur due to poor condition of roads or motor vehicles, alcoholism, absence of road signs and failure to observe road signs. Moreover, lack of road safety education, overloading of motor vehicles and tiredness of drivers and riders may also cause road accidents. Most road accidents are common during bad weather and when the roads are in a bad condition."
        },
        {
          "page_number": 114,
          "subtopic": "Magnitude of road accidents in Tanzania",
          "content": "**Magnitude of road accidents in Tanzania**\nAccording to statistics from Tanzania Traffic Police, pedestrians and passengers constitute the largest group of road users who die in road accidents, followed by motorcyclists. Handcarts and pedal cyclists constitute the smallest number of people who lose their lives in road accidents. [TABLE 9.1: Road accidents from 2015 to 2020 in Tanzania] shows the trend of the magnitude of road accidents in Tanzania from 2015 to 2020."
        },
        {
          "page_number": 115,
          "subtopic": "Magnitude of road accidents in Tanzania",
          "content": "[TABLE 9.1: Road accidents from 2015 to 2020 in Tanzania]\n\nIn general, the trend shows that the number of road accidents increased from 2015 to 2016, and that, it dropped from 2017 to 2020. The decline was attributed to efforts of the government and other stakeholders to ensure adherence to road traffic rules. The government, through the Ministry of Home Affairs organises a road safety week every year to create awareness on safety measures among road users. During such week, road users and the public are educated about such measures. The road safety week is also accompanied by several activities, including inspection of motor vehicles and raising public awareness about the importance of observing road signs. Since 2015, the motto for the road safety week has been “Drive safely” and “Save lives”. [FIGURE 9.15: Students matching during road safety week]"
        },
        {
          "page_number": 116,
          "subtopic": "Effects of road accidents",
          "content": "**Effects of road accidents**\nGenerally, road accidents have negative effects on road users. The following are the effects of road accidents:\n(a) They lead to the death of people and other living organisms such as cattle and wild animals;\n(b) They cause destruction of properties such as cars and houses;\n(c) They increase government expenditure as a result of the spending of money treating patients or victims and replacing damaged property such as road infrastructure;\n(d) They make people’s property and other commodities transported by road to arrive late at the destinations due to traffic jam;\n(e) They cause the loss of manpower as a result of death and injuries;\n(f) They increase the number of orphans especially when parents are involved in an accident that causes their death; and\n(g) They can cause permanent disabilities."
        },
        {
          "page_number": 116,
          "subtopic": "Prevention of road accidents",
          "content": "**Prevention of road accidents**\nRoad accidents can be prevented in the following ways:\n(a) Educating drivers about safe driving and respecting road signs as well as reinforcing laws to protect road users and their property;\n(b) New drivers should be properly tested and undergo a thorough medical examination. Only those who pass the tests and who are in good health should be given driving licences;\n(c) The use of seat belts should be constantly observed by all drivers and passengers. Fastening seat belts would reduce the chances of injuries and deaths happening when accidents occur;\n(d) Drivers must avoid driving while drunk. The influence of drugs or alcohol may make drivers cause accidents. People who drive while drunk should be punished in accordance with the law;\n(e) Servicing and checking motor vehicles regularly must be mandatory. For example, brakes, tires, lights and mirrors must be checked regularly;"
        },
        {
          "page_number": 117,
          "subtopic": "Prevention of road accidents",
          "content": "(f) Mobile phones should not be used when one is driving or walking along the road; and\n(g) Drivers should avoid eating and/or drinking while driving so as to increase their concentration."
        },
        {
          "page_number": 117,
          "subtopic": "Helping people with disabilities, children and the elderly to cross roads",
          "content": "**Helping people with disabilities, children and the elderly to cross roads**\nStudy the figure below and answer the questions that follow.\n\n[FIGURE 9.16: Helping a person with disability to cross the road]",
          "exercise": "9.2"
        },
        {
          "page_number": 118,
          "subtopic": "Helping people with disabilities, children and the elderly to cross roads",
          "content": "People with disabilities, children and the elderly may not be able to cross the road safely because of their condition. Therefore, they must be helped to cross the road. As such, road safety education should be provided to all road users. They should be educated on how to use road signs such as a zebra crossing. If there is no zebra crossing on the road, they should be educated on how to use the left hand to hold a person with disability, children or elderly and to use the right hand to stop motor vehicles before crossing the road.\n\nDrivers must be aware of these people and consider them when driving. They should give them enough time so that they can safely cross the road. They should also know about the white cane used by the blind. Therefore, everyone is responsible for helping people with disabilities, children and the elderly to cross the road safely.",
          "exercise": "9.3"
        },
        {
          "page_number": 119,
          "subtopic": "Helping people with disabilities, children and the elderly to cross roads",
          "content": ""
        },
        {
          "page_number": 120,
          "subtopic": "Helping people with disabilities, children and the elderly to cross roads",
          "content": ""
        },
        {
          "page_number": 121,
          "subtopic": "Helping people with disabilities, children and the elderly to cross roads",
          "content": "",
          "revision_exercise": "9"
        }
      ]
    }
  ]
}
